{
  "recipes":[
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c118998"},
      "name": "Pad Thai",
      "ingredients": ["Rice Noodles", "Shrimp", "Tofu", "Bean Sprouts", "Eggs", "Peanuts", "Green Onions", "Garlic", "Tamarind Paste", "Fish Sauce", "Sugar", "Lime", "Chili Flakes"],
      "instructions": "1. Soak rice noodles in warm water until softened. 2. Heat oil in a wok or large skillet. 3. Add minced garlic and stir-fry until fragrant. 4. Add shrimp and tofu, cook until shrimp turns pink. 5. Push ingredients to one side and crack eggs into the pan. Scramble until set. 6. Add drained noodles, tamarind paste, fish sauce, sugar, and lime juice. 7. Stir-fry until noodles are well coated. 8. Toss in bean sprouts and green onions. 9. Serve hot, garnished with crushed peanuts and chili flakes.",
      "cuisine": "Asian",
      "difficulty": "Medium",
      "image": "https://source.unsplash.com/random/900x700/?padthai",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c118999"},
      "name": "Sushi Rolls",
      "ingredients": ["Sushi Rice", "Nori Seaweed", "Assorted Fish (e.g., Tuna, Salmon, Yellowtail)", "Cucumber", "Avocado", "Carrot", "Sesame Seeds", "Soy Sauce", "Wasabi", "Pickled Ginger"],
      "instructions": "1. Prepare sushi rice according to package instructions and let it cool. 2. Place a sheet of nori on a bamboo sushi mat. 3. Spread a thin layer of rice over the nori, leaving a border at the top. 4. Arrange strips of fish, cucumber, avocado, and carrot in the center of the rice. 5. Roll the sushi tightly using the bamboo mat. 6. Slice into bite-sized pieces using a sharp knife. 7. Serve with soy sauce, wasabi, and pickled ginger.",
      "cuisine": "Asian",
      "difficulty": "Medium",
      "image": "https://source.unsplash.com/random/900x700/?sushi",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c11899a"},
      "name": "Chicken Teriyaki",
      "ingredients": ["Chicken Thighs", "Soy Sauce", "Mirin", "Brown Sugar", "Garlic", "Ginger", "Sesame Oil", "Green Onions", "Sesame Seeds"],
      "instructions": "1. In a bowl, mix soy sauce, mirin, brown sugar, minced garlic, grated ginger, and sesame oil to make the teriyaki sauce. 2. Marinate chicken thighs in the sauce for at least 30 minutes. 3. Heat a skillet over medium-high heat and add a little oil. 4. Cook chicken thighs until browned on both sides and cooked through. 5. Pour remaining marinade into the skillet and simmer until thickened. 6. Serve chicken teriyaki hot, garnished with sliced green onions and sesame seeds.",
      "cuisine": "Asian",
      "difficulty": "Easy",
      "image": "https://source.unsplash.com/random/900x700/?chickenteriyaki",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c11899b"},
      "name": "Beef Pho",
      "ingredients": ["Beef Bones", "Beef Sirloin", "Rice Noodles", "Onion", "Ginger", "Star Anise", "Cinnamon", "Cloves", "Coriander Seeds", "Fish Sauce", "Soy Sauce", "Bean Sprouts", "Thai Basil", "Lime", "Chili"],
      "instructions": "1. Roast beef bones in the oven until browned. 2. In a large pot, cover bones with water and bring to a boil. Skim off any foam. 3. Add sliced onion, ginger, star anise, cinnamon, cloves, and coriander seeds to the pot. 4. Simmer for at least 6 hours, adding water as needed. 5. Strain broth and return it to the pot. 6. Add sliced beef sirloin and cook until just cooked through. 7. Cook rice noodles according to package instructions. 8. To serve, divide noodles among bowls and top with beef slices. 9. Pour hot broth over the noodles. 10. Serve with bean sprouts, Thai basil, lime wedges, and sliced chili.",
      "cuisine": "Asian",
      "difficulty": "Hard",
      "image": "https://source.unsplash.com/random/900x700/?pho",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c11899c"},
      "name": "Chicken Curry",
      "ingredients": ["Chicken Thighs", "Coconut Milk", "Curry Paste", "Onion", "Garlic", "Ginger", "Potatoes", "Carrots", "Bell Pepper", "Fish Sauce", "Sugar", "Lime", "Thai Basil"],
      "instructions": "1. In a pot, heat oil and sauté chopped onion, minced garlic, and grated ginger until fragrant. 2. Add chicken thighs and cook until browned. 3. Stir in curry paste and cook for a few minutes. 4. Pour in coconut milk and bring to a simmer. 5. Add diced potatoes, carrots, and bell pepper to the pot. 6. Simmer until chicken is cooked through and vegetables are tender. 7. Season with fish sauce, sugar, and lime juice. 8. Serve hot, garnished with chopped Thai basil.",
      "cuisine": "Asian",
      "difficulty": "Medium",
      "image": "https://source.unsplash.com/random/900x700/?chickencurry",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c11899d"},
      "name": "Kimchi Fried Rice",
      "ingredients": ["Cooked Rice", "Kimchi", "Bacon", "Eggs", "Soy Sauce", "Sesame Oil", "Green Onions"],
      "instructions": "1. Chop kimchi and bacon into small pieces. 2. Heat oil in a skillet and cook bacon until crispy. 3. Add chopped kimchi and cook until heated through. 4. Stir in cooked rice and soy sauce. 5. Push rice mixture to one side and crack eggs into the skillet. Scramble until set. 6. Mix everything together and drizzle with sesame oil. 7. Serve hot, garnished with sliced green onions.",
      "cuisine": "Asian",
      "difficulty": "Easy",
      "image": "https://source.unsplash.com/random/900x700/?kimchifriedrice",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c11899e"},
      "name": "Thai Green Curry",
      "ingredients": ["Chicken Breast", "Thai Green Curry Paste", "Coconut Milk", "Bamboo Shoots", "Bell Peppers", "Thai Eggplant", "Fish Sauce", "Sugar", "Thai Basil", "Kaffir Lime Leaves"],
      "instructions": "1. In a wok or large skillet, heat coconut milk over medium heat until it starts to bubble. 2. Add Thai green curry paste and stir until fragrant. 3. Add sliced chicken breast and cook until no longer pink. 4. Stir in bamboo shoots, sliced bell peppers, and quartered Thai eggplant. 5. Simmer until vegetables are tender. 6. Season with fish sauce and sugar to taste. 7. Garnish with torn Thai basil leaves and shredded kaffir lime leaves. 8. Serve hot with steamed rice.",
      "cuisine": "Asian",
      "difficulty": "Medium",
      "image": "https://source.unsplash.com/random/900x700/?thaigreencurry",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c11899f"},
      "name": "Shrimp Tempura",
      "ingredients": ["Shrimp", "Tempura Batter Mix", "Ice Water", "Vegetable Oil", "Dipping Sauce (e.g., Soy Sauce, Mirin, Rice Vinegar)"],
      "instructions": "1. Peel and devein shrimp, leaving the tails intact. 2. Prepare tempura batter by mixing tempura batter mix with ice water until just combined. 3. Heat vegetable oil in a deep fryer or large pot to 350°F (180°C). 4. Dip shrimp into the tempura batter, then carefully place them into the hot oil. 5. Fry until golden brown and crispy, about 2-3 minutes. 6. Drain on paper towels. 7. Serve hot with dipping sauce.",
      "cuisine": "Asian",
      "difficulty": "Medium",
      "image": "https://source.unsplash.com/random/900x700/?shrimptempura",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c1189a0"},
      "name": "Beef Bulgogi",
      "ingredients": ["Beef Sirloin", "Soy Sauce", "Sesame Oil", "Sugar", "Garlic", "Ginger", "Green Onions", "Sesame Seeds", "Asian Pear", "Rice", "Lettuce Leaves"],
      "instructions": "1. Thinly slice beef sirloin and place it in a bowl. 2. In a separate bowl, mix together soy sauce, sesame oil, sugar, minced garlic, grated ginger, chopped green onions, and sesame seeds to make the marinade. 3. Pour the marinade over the beef slices and mix well. 4. Cover and refrigerate for at least 1 hour, or overnight. 5. Heat a grill or skillet over high heat. 6. Cook the marinated beef slices until browned and cooked through. 7. Serve hot with rice and lettuce leaves for wrapping.",
      "cuisine": "Asian",
      "difficulty": "Medium",
      "image": "https://source.unsplash.com/random/900x700/?bulgogi",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c1189a1"},
      "name": "Vegetable Spring Rolls",
      "ingredients": ["Rice Paper Wrappers", "Shredded Cabbage", "Carrots", "Cucumber", "Bell Pepper", "Mint Leaves", "Rice Vermicelli Noodles", "Peanut Sauce (for dipping)"],
      "instructions": "1. Soften rice paper wrappers by dipping them in warm water for a few seconds. 2. Lay softened wrapper flat on a clean surface. 3. Place a small amount of shredded cabbage, julienne carrots, cucumber slices, bell pepper strips, mint leaves, and cooked rice vermicelli noodles on the lower third of the wrapper. 4. Fold the bottom of the wrapper over the filling, then fold in the sides and roll tightly. 5. Repeat with remaining ingredients. 6. Serve vegetable spring rolls with peanut sauce for dipping.",
      "cuisine": "Asian",
      "difficulty": "Easy",
      "image": "https://source.unsplash.com/random/900x700/?springrolls",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
  
  
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c1189a2"},
      "name": "Margherita Pizza",
      "ingredients": ["Pizza Dough", "Tomato Sauce", "Fresh Mozzarella", "Fresh Basil Leaves", "Extra Virgin Olive Oil", "Salt", "Black Pepper"],
      "instructions": "1. Preheat your oven to its highest setting with a pizza stone inside. 2. Stretch out the pizza dough into a circle. 3. Spread a thin layer of tomato sauce over the dough. 4. Tear the fresh mozzarella into pieces and distribute evenly over the sauce. 5. Scatter fresh basil leaves over the pizza. 6. Drizzle with extra virgin olive oil and season with salt and black pepper. 7. Transfer the pizza to the hot pizza stone and bake until the crust is golden and the cheese is bubbly and browned in spots. 8. Remove from the oven, let it cool slightly, then slice and serve.",
      "cuisine": "Italian",
      "difficulty": "Easy",
      "image": "https://source.unsplash.com/random/900x700/?pizza",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c1189a3"},
      "name": "Spaghetti Carbonara",
      "ingredients": ["Spaghetti", "Guanciale or Pancetta", "Eggs", "Pecorino Romano Cheese", "Black Pepper"],
      "instructions": "1. Cook spaghetti in a large pot of salted boiling water until al dente. 2. Meanwhile, in a skillet, cook diced guanciale or pancetta until crispy. 3. In a bowl, whisk together eggs, grated pecorino romano cheese, and black pepper. 4. Drain cooked spaghetti and immediately toss with the egg mixture in the skillet over low heat. 5. Stir until the eggs thicken and coat the pasta. 6. Serve hot, garnished with additional grated cheese and black pepper.",
      "cuisine": "Italian",
      "difficulty": "Easy",
      "image": "https://source.unsplash.com/random/900x700/?carbonara",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c1189a4"},
      "name": "Lasagna",
      "ingredients": ["Lasagna Noodles", "Ground Beef", "Italian Sausage", "Onion", "Garlic", "Tomato Sauce", "Ricotta Cheese", "Mozzarella Cheese", "Parmesan Cheese", "Egg", "Fresh Parsley", "Salt", "Black Pepper", "Olive Oil"],
      "instructions": "1. Preheat oven to 375°F (190°C). 2. Cook lasagna noodles according to package instructions, then drain and set aside. 3. In a skillet, heat olive oil over medium heat. 4. Add diced onion and minced garlic, sauté until softened. 5. Add ground beef and Italian sausage, cook until browned. 6. Stir in tomato sauce and simmer for 10 minutes. 7. In a bowl, mix together ricotta cheese, egg, chopped parsley, salt, and black pepper. 8. In a baking dish, layer noodles, meat sauce, ricotta mixture, and mozzarella cheese. Repeat layers, ending with mozzarella and parmesan cheese on top. 9. Cover with foil and bake for 30 minutes. 10. Remove foil and bake for an additional 15 minutes, or until cheese is bubbly and golden brown. 11. Let it cool for a few minutes before serving.",
      "cuisine": "Italian",
      "difficulty": "Medium",
      "image": "https://source.unsplash.com/random/900x700/?lasagna",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c1189a5"},
      "name": "Risotto ai Funghi",
      "ingredients": ["Arborio Rice", "Mushrooms", "Shallots", "Garlic", "White Wine", "Vegetable or Chicken Broth", "Butter", "Parmesan Cheese", "Fresh Thyme", "Salt", "Black Pepper", "Olive Oil"],
      "instructions": "1. In a saucepan, heat vegetable or chicken broth and keep it warm. 2. In a separate large skillet, heat olive oil and butter over medium heat. 3. Add finely chopped shallots and minced garlic, sauté until softened. 4. Add sliced mushrooms and cook until they release their liquid and turn golden brown. 5. Stir in Arborio rice and cook for a few minutes until lightly toasted. 6. Deglaze the skillet with white wine and cook until it's mostly evaporated. 7. Begin adding warm broth to the skillet, one ladleful at a time, stirring frequently and allowing each addition to be absorbed before adding more. 8. Continue this process until the rice is creamy and tender, about 18-20 minutes. 9. Stir in grated Parmesan cheese, fresh thyme leaves, salt, and black pepper. 10. Remove from heat and let it rest for a few minutes before serving.",
      "cuisine": "Italian",
      "difficulty": "Medium",
      "image": "https://source.unsplash.com/random/900x700/?risotto",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c1189a6"},
      "name": "Tiramisu",
      "ingredients": ["Ladyfingers", "Espresso Coffee", "Marsala Wine", "Egg Yolks", "Granulated Sugar", "Mascarpone Cheese", "Heavy Cream", "Cocoa Powder"],
      "instructions": "1. Brew espresso coffee and let it cool to room temperature. 2. In a bowl, whisk together egg yolks and granulated sugar until pale and creamy. 3. Add mascarpone cheese to the egg mixture and beat until smooth. 4. In another bowl, whip heavy cream until stiff peaks form. 5. Gently fold the whipped cream into the mascarpone mixture until well combined. 6. Dip ladyfingers into the espresso coffee mixed with Marsala wine, then arrange a layer of dipped ladyfingers in the bottom of a serving dish. 7. Spread half of the mascarpone mixture over the ladyfingers. 8. Repeat with another layer of dipped ladyfingers and the remaining mascarpone mixture. 9. Cover and refrigerate for at least 4 hours, preferably overnight. 10. Before serving, dust the top with cocoa powder.",
      "cuisine": "Italian",
      "difficulty": "Medium",
      "image": "https://source.unsplash.com/random/900x700/?tiramisu",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c1189a7"},
      "name": "Chicken Parmesan",
      "ingredients": ["Chicken Breasts", "Eggs", "Breadcrumbs", "Parmesan Cheese", "Mozzarella Cheese", "Tomato Sauce", "Olive Oil", "Salt", "Black Pepper", "Fresh Basil Leaves"],
      "instructions": "1. Preheat oven to 375°F (190°C). 2. Season chicken breasts with salt and black pepper. 3. In one shallow dish, whisk eggs. In another shallow dish, mix breadcrumbs with grated Parmesan cheese. 4. Dip each chicken breast into the beaten eggs, then dredge in the breadcrumb mixture, pressing to adhere. 5. Heat olive oil in a skillet over medium-high heat. 6. Add breaded chicken breasts and cook until golden brown on both sides. 7. Transfer chicken to a baking dish, spoon tomato sauce over each piece, and top with shredded mozzarella cheese. 8. Bake until chicken is cooked through and cheese is bubbly and golden, about 20-25 minutes. 9. Garnish with fresh basil leaves before serving.",
      "cuisine": "Italian",
      "difficulty": "Medium",
      "image": "https://source.unsplash.com/random/900x700/?chickenparmesan",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c1189a8"},
      "name": "Pasta Aglio e Olio",
      "ingredients": ["Spaghetti", "Garlic", "Red Chili Flakes", "Extra Virgin Olive Oil", "Fresh Parsley", "Salt", "Black Pepper", "Grated Parmesan Cheese"],
      "instructions": "1. Cook spaghetti in a large pot of salted boiling water until al dente. 2. While pasta is cooking, mince garlic and chop fresh parsley. 3. In a skillet, heat extra virgin olive oil over medium heat. 4. Add minced garlic and red chili flakes, sauté until garlic is golden but not browned. 5. Drain cooked spaghetti and add it to the skillet with the garlic oil. 6. Toss well to coat the pasta with the oil. 7. Season with salt and black pepper to taste. 8. Serve hot, garnished with chopped parsley and grated Parmesan cheese.",
      "cuisine": "Italian",
      "difficulty": "Easy",
      "image": "https://source.unsplash.com/random/900x700/?pasta",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c1189a9"},
      "name": "Bruschetta",
      "ingredients": ["Baguette", "Ripe Tomatoes", "Garlic", "Fresh Basil Leaves", "Extra Virgin Olive Oil", "Balsamic Vinegar", "Salt", "Black Pepper"],
      "instructions": "1. Preheat oven to 400°F (200°C). 2. Slice baguette into ½-inch thick slices and arrange them on a baking sheet. 3. Drizzle with olive oil and season with salt. 4. Toast in the oven until golden brown, about 5-7 minutes. 5. Meanwhile, chop ripe tomatoes, garlic, and fresh basil leaves. 6. In a bowl, mix together chopped tomatoes, minced garlic, torn basil leaves, olive oil, balsamic vinegar, salt, and black pepper. 7. Spoon the tomato mixture over the toasted baguette slices. 8. Serve immediately as an appetizer or snack.",
      "cuisine": "Italian",
      "difficulty": "Easy",
      "image": "https://source.unsplash.com/random/900x700/?bruschetta",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c1189aa"},
      "name": "Caprese Salad",
      "ingredients": ["Fresh Mozzarella", "Ripe Tomatoes", "Fresh Basil Leaves", "Extra Virgin Olive Oil", "Balsamic Vinegar", "Salt", "Black Pepper"],
      "instructions": "1. Slice fresh mozzarella and ripe tomatoes into ¼-inch thick slices. 2. Arrange alternating slices of mozzarella, tomato, and basil leaves on a serving platter. 3. Drizzle with extra virgin olive oil and balsamic vinegar. 4. Season with salt and black pepper to taste. 5. Serve immediately as a refreshing appetizer or side dish.",
      "cuisine": "Italian",
      "difficulty": "Easy",
      "image": "https://source.unsplash.com/random/900x700/?capresesalad",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    {
      "_id": {"$oid": "60abf0fd6f59b31e1c1189ab"},
      "name": "Gnocchi alla Sorrentina",
      "ingredients": ["Gnocchi", "Tomato Sauce", "Fresh Mozzarella", "Fresh Basil Leaves", "Grated Parmesan Cheese", "Salt", "Black Pepper", "Olive Oil"],
      "instructions": "1. Preheat oven to 375°F (190°C). 2. Cook gnocchi in a large pot of salted boiling water until they float to the surface. 3. Drain gnocchi and toss them with tomato sauce in a baking dish. 4. Tear fresh mozzarella into pieces and scatter over the gnocchi. 5. Tear fresh basil leaves and sprinkle over the mozzarella. 6. Season with salt and black pepper. 7. Drizzle with olive oil and sprinkle grated Parmesan cheese on top. 8. Bake until the cheese is bubbly and golden brown, about 20 minutes. 9. Serve hot, garnished with additional fresh basil leaves.",
      "cuisine": "Italian",
      "difficulty": "Easy",
      "image": "https://source.unsplash.com/random/900x700/?gnocchi",
      "likes": null,
      "averageRating": 0,
      "Rating": [],
      "comments": []
    },
    
      {
        "_id": {"$oid": "60abf0fd6f59b31e1c1189ac"},
        "name": "Chicken Tikka Masala",
        "ingredients": ["Chicken Thighs", "Yogurt", "Lemon Juice", "Ginger-Garlic Paste", "Garam Masala", "Turmeric Powder", "Cumin Powder", "Coriander Powder", "Kashmiri Red Chili Powder", "Tomato Puree", "Heavy Cream", "Butter", "Salt", "Fresh Cilantro"],
        "instructions": "1. Marinate chicken thighs in yogurt, lemon juice, ginger-garlic paste, garam masala, turmeric powder, cumin powder, coriander powder, Kashmiri red chili powder, and salt for at least 1 hour. 2. Skewer the marinated chicken and grill until charred and cooked through. 3. In a pan, melt butter and add tomato puree. Cook until the puree thickens and the oil separates. 4. Add heavy cream and simmer for a few minutes. 5. Add the grilled chicken to the sauce and simmer for another 5-10 minutes. 6. Garnish with fresh cilantro before serving.",
        "cuisine": "Indian",
        "difficulty": "Medium",
        "image": "https://source.unsplash.com/random/900x700/?chickentikkamasala",
        "likes": null,
        "averageRating": 0,
        "Rating": [],
        "comments": []
      },
      {
        "_id": {"$oid": "60abf0fd6f59b31e1c1189ad"},
        "name": "Palak Paneer",
        "ingredients": ["Paneer", "Spinach", "Tomatoes", "Onion", "Ginger", "Garlic", "Green Chili", "Cumin Seeds", "Turmeric Powder", "Coriander Powder", "Garam Masala", "Heavy Cream", "Salt", "Butter"],
        "instructions": "1. Blanch spinach leaves in boiling water for a few seconds, then transfer to ice water. Drain and blend into a smooth puree. 2. In a pan, heat butter and add cumin seeds. 3. Add finely chopped onion, ginger, garlic, and green chili. Sauté until golden brown. 4. Add chopped tomatoes and cook until soft. 5. Stir in turmeric powder, coriander powder, and garam masala. 6. Add the spinach puree and cook until the mixture thickens. 7. Add cubed paneer and simmer for a few minutes. 8. Stir in heavy cream and season with salt. 9. Serve hot with naan or rice.",
        "cuisine": "Indian",
        "difficulty": "Medium",
        "image": "https://source.unsplash.com/random/900x700/?palakpaneer",
        "likes": null,
        "averageRating": 0,
        "Rating": [],
        "comments": []
      },
      {
        "_id": {"$oid": "60abf0fd6f59b31e1c1189ae"},
        "name": "Butter Chicken",
        "ingredients": ["Chicken Thighs", "Yogurt", "Lemon Juice", "Ginger-Garlic Paste", "Garam Masala", "Kashmiri Red Chili Powder", "Turmeric Powder", "Cumin Powder", "Coriander Powder", "Tomato Puree", "Cashew Paste", "Heavy Cream", "Butter", "Kasuri Methi", "Salt"],
        "instructions": "1. Marinate chicken thighs in yogurt, lemon juice, ginger-garlic paste, garam masala, Kashmiri red chili powder, turmeric powder, cumin powder, coriander powder, and salt for at least 1 hour. 2. Grill the marinated chicken until charred and cooked through. 3. In a pan, melt butter and add tomato puree. Cook until the puree thickens and the oil separates. 4. Add cashew paste and heavy cream. Simmer until the sauce thickens. 5. Add grilled chicken to the sauce and simmer for a few minutes. 6. Crush kasuri methi between your palms and sprinkle over the chicken. 7. Serve hot with naan or rice.",
        "cuisine": "Indian",
        "difficulty": "Medium",
        "image": "https://source.unsplash.com/random/900x700/?butterchicken",
        "likes": null,
        "averageRating": 0,
        "Rating": [],
        "comments": []
      },
      {
        "_id": {"$oid": "60abf0fd6f59b31e1c1189af"},
        "name": "Chole (Chickpea Curry)",
        "ingredients": ["Chickpeas", "Onion", "Tomatoes", "Ginger", "Garlic", "Green Chili", "Cumin Seeds", "Coriander Powder", "Turmeric Powder", "Garam Masala", "Amchur (Dry Mango Powder)", "Kasuri Methi", "Fresh Cilantro", "Salt", "Oil"],
        "instructions": "1. Soak chickpeas overnight, then cook until tender. 2. In a pan, heat oil and add cumin seeds. 3. Add finely chopped onion, ginger, garlic, and green chili. Sauté until golden brown. 4. Add chopped tomatoes and cook until soft. 5. Stir in coriander powder, turmeric powder, and garam masala. 6. Add cooked chickpeas and mix well. 7. Add water if necessary and simmer until the curry thickens. 8. Crush kasuri methi between your palms and sprinkle over the curry. 9. Garnish with fresh cilantro before serving.",
        "cuisine": "Indian",
        "difficulty": "Easy",
        "image": "https://source.unsplash.com/random/900x700/?chole",
        "likes": null,
        "averageRating": 0,
        "Rating": [],
        "comments": []
      },
      {
        "_id": {"$oid": "60abf0fd6f59b31e1c1189b0"},
        "name": "Biryani",
        "ingredients": ["Basmati Rice", "Chicken Thighs", "Yogurt", "Ginger-Garlic Paste", "Onions", "Tomatoes", "Green Chilies", "Mint Leaves", "Cilantro", "Garam Masala", "Turmeric Powder", "Red Chili Powder", "Biryani Masala", "Saffron", "Milk", "Butter", "Salt", "Oil"],
        "instructions": "1. Soak basmati rice for 30 minutes, then drain. 2. Marinate chicken thighs in yogurt, ginger-garlic paste, garam masala, turmeric powder, red chili powder, and salt for at least 1 hour. 3. In a pan, heat oil and fry thinly sliced onions until golden brown. Remove half for garnish. 4. Add chopped tomatoes, green chilies, mint leaves, and cilantro to the remaining onions. Cook until the tomatoes are soft. 5. Layer marinated chicken over the onion-tomato mixture. 6. Top with soaked basmati rice. 7. Sprinkle biryani masala and saffron soaked in milk over the rice. 8. Dot with butter and sprinkle fried onions on top. 9. Cover and cook on low heat until the rice and chicken are cooked through. 10. Serve hot with raita.",
        "cuisine": "Indian",
        "difficulty": "Medium",
        "image": "https://source.unsplash.com/random/900x700/?biryani",
        "likes": null,
        "averageRating": 0,
        "Rating": [],
        "comments": []
      },
      {
        "_id": {"$oid": "60abf0fd6f59b31e1c1189b1"},
        "name": "Dosa",
        "ingredients": ["Rice", "Urad Dal (Black Lentils)", "Fenugreek Seeds", "Salt", "Oil"],
        "instructions": "1. Soak rice, urad dal, and fenugreek seeds separately for at least 6 hours. 2. Grind rice and urad dal separately into smooth pastes. 3. Mix the ground rice and urad dal together, adding salt and enough water to make a batter. 4. Let the batter ferment overnight. 5. Heat a non-stick pan and grease it with oil. 6. Pour a ladleful of batter onto the pan and spread it into a thin circle. 7. Drizzle oil around the edges and cook until golden brown. 8. Serve hot with sambar and chutney.",
        "cuisine": "Indian",
        "difficulty": "Medium",
        "image": "https://source.unsplash.com/random/900x700/?dosa",
        "likes": null,
        "averageRating": 0,
        "Rating": [],
        "comments": []
      },
      {
        "_id": {"$oid": "60abf0fd6f59b31e1c1189b2"},
        "name": "Rogan Josh",
        "ingredients": ["Lamb", "Onions", "Tomatoes", "Ginger", "Garlic", "Yogurt", "Red Chili Powder", "Coriander Powder", "Turmeric Powder", "Garam Masala", "Kashmiri Red Chili Powder", "Fennel Powder", "Cloves", "Cardamom", "Cinnamon", "Bay Leaves", "Salt", "Oil"],
        "instructions": "1. Marinate lamb pieces in yogurt, red chili powder, coriander powder, turmeric powder, and salt for at least 1 hour. 2. In a pan, heat oil and add whole spices (cloves, cardamom, cinnamon, bay leaves). 3. Add finely chopped onions and sauté until golden brown. 4. Add ginger-garlic paste and cook until the raw smell disappears. 5. Add chopped tomatoes and cook until soft. 6. Stir in marinated lamb and cook until browned. 7. Add Kashmiri red chili powder, fennel powder, and garam masala. 8. Add water if necessary and simmer until the lamb is tender. 9. Garnish with fresh cilantro before serving.",
        "cuisine": "Indian",
        "difficulty": "Medium",
        "image": "https://source.unsplash.com/random/900x700/?roganjosh",
        "likes": null,
        "averageRating": 0,
        "Rating": [],
        "comments": []
      },
      {
        "_id": {"$oid": "60abf0fd6f59b31e1c1189b3"},
        "name": "Paneer Butter Masala",
        "ingredients": ["Paneer", "Tomatoes", "Onions", "Ginger", "Garlic", "Green Chilies", "Cashews", "Heavy Cream", "Butter", "Kasuri Methi", "Garam Masala", "Kashmiri Red Chili Powder", "Turmeric Powder", "Coriander Powder", "Salt", "Oil"],
        "instructions": "1. Blend tomatoes, onions, ginger, garlic, green chilies, and cashews into a smooth paste. 2. In a pan, heat butter and add the blended paste. Cook until the mixture thickens and the oil separates. 3. Add kasuri methi, garam masala, Kashmiri red chili powder, turmeric powder, and coriander powder. 4. Stir in heavy cream and cook for a few minutes. 5. Add cubed paneer and simmer until heated through. 6. Garnish with fresh cilantro before serving.",
        "cuisine": "Indian",
        "difficulty": "Medium",
        "image": "https://source.unsplash.com/random/900x700/?paneerbuttermasala",
        "likes": null,
        "averageRating": 0,
        "Rating": [],
        "comments": []
      },
      {
        "_id": {"$oid": "60abf0fd6f59b31e1c1189b4"},
        "name": "Vegetable Biryani",
        "ingredients": ["Basmati Rice", "Mixed Vegetables (Carrots, Beans, Peas, Potatoes, Cauliflower)", "Onion", "Tomatoes", "Ginger-Garlic Paste", "Green Chilies", "Mint Leaves", "Cilantro", "Garam Masala", "Turmeric Powder", "Red Chili Powder", "Saffron", "Milk", "Butter", "Salt", "Oil"],
        "instructions": "1. Soak basmati rice for 30 minutes, then drain. 2. In a pan, heat oil and fry thinly sliced onions until golden brown. Remove half for garnish. 3. Add chopped tomatoes, green chilies, mint leaves, and cilantro to the remaining onions. Cook until the tomatoes are soft. 4. Add mixed vegetables and cook until slightly tender. 5. Layer soaked basmati rice over the vegetable mixture. 6. Sprinkle garam masala, turmeric powder, and red chili powder over the rice. 7. Pour saffron soaked in milk over the rice. 8. Dot with butter and sprinkle fried onions on top. 9. Cover and cook on low heat until the rice and vegetables are cooked through. 10. Serve hot with raita.",
        "cuisine": "Indian",
        "difficulty": "Medium",
        "image": "https://source.unsplash.com/random/900x700/?vegetablebiryani",
        "likes": null,
        "averageRating": 0,
        "Rating": [],
        "comments": []
      },
      {
        "_id": {"$oid": "60abf0fd6f59b31e1c1189b5"},
        "name": "Aloo Gobi",
        "ingredients": ["Potatoes", "Cauliflower", "Onion", "Tomatoes", "Ginger", "Garlic", "Green Chilies", "Turmeric Powder", "Cumin Seeds", "Coriander Powder", "Garam Masala", "Fresh Cilantro", "Salt", "Oil"],
        "instructions": "1. Heat oil in a pan and add cumin seeds. 2. Add finely chopped onion, ginger, garlic, and green chilies. Sauté until golden brown. 3. Add chopped tomatoes and cook until soft. 4. Stir in turmeric powder, coriander powder, and garam masala. 5. Add cubed potatoes and cauliflower florets. Mix well. 6. Cover and cook until the vegetables are tender. 7. Garnish with fresh cilantro before serving.",
        "cuisine": "Indian",
        "difficulty": "Easy",
        "image": "https://source.unsplash.com/random/900x700/?aloogobi",
        "likes": null,
        "averageRating": 0,
        "Rating": [],
        "comments": []
      },
        {
          "_id": {"$oid": "60abf0fd6f59b31e1c1189b6"},
          "name": "Classic Cheeseburger",
          "ingredients": ["Ground Beef", "Hamburger Buns", "Cheddar Cheese", "Lettuce", "Tomato", "Onion", "Pickles", "Ketchup", "Mustard", "Salt", "Black Pepper"],
          "instructions": "1. Divide ground beef into equal portions and form them into patties. Season with salt and black pepper. 2. Preheat grill or skillet over medium-high heat. Cook patties until desired doneness, flipping once. 3. Toast hamburger buns on the grill or in a toaster. 4. Assemble burgers by placing patties on the bottom bun, then adding cheese, lettuce, tomato, onion, and pickles. 5. Spread ketchup and mustard on the top bun, then place it on top of the burger. 6. Serve hot with your favorite side dishes.",
          "cuisine": "American",
          "difficulty": "Easy",
          "image": "https://source.unsplash.com/random/900x700/?cheeseburger",
          "likes": null,
          "averageRating": 0,
          "Rating": [],
          "comments": []
        },
        {
          "_id": {"$oid": "60abf0fd6f59b31e1c1189b7"},
          "name": "Macaroni and Cheese",
          "ingredients": ["Elbow Macaroni", "Cheddar Cheese", "Butter", "All-Purpose Flour", "Milk", "Mustard Powder", "Salt", "Black Pepper", "Breadcrumbs"],
          "instructions": "1. Cook elbow macaroni according to package instructions. Drain and set aside. 2. In a saucepan, melt butter over medium heat. Whisk in flour and mustard powder to make a roux. 3. Slowly pour in milk while whisking constantly until the mixture thickens. 4. Stir in shredded cheddar cheese until melted and smooth. Season with salt and black pepper. 5. Add cooked macaroni to the cheese sauce and stir until well coated. 6. Pour the macaroni and cheese mixture into a baking dish. Sprinkle breadcrumbs over the top. 7. Bake in a preheated oven at 350°F (175°C) for 20-25 minutes, or until bubbly and golden brown. 8. Let it cool slightly before serving.",
          "cuisine": "American",
          "difficulty": "Easy",
          "image": "https://source.unsplash.com/random/900x700/?macandcheese",
          "likes": null,
          "averageRating": 0,
          "Rating": [],
          "comments": []
        },
        {
          "_id": {"$oid": "60abf0fd6f59b31e1c1189b8"},
          "name": "Fried Chicken",
          "ingredients": ["Chicken Pieces (Drumsticks, Thighs, Breasts)", "Buttermilk", "All-Purpose Flour", "Cornstarch", "Paprika", "Garlic Powder", "Onion Powder", "Salt", "Black Pepper", "Vegetable Oil"],
          "instructions": "1. Marinate chicken pieces in buttermilk for at least 1 hour or overnight. 2. In a shallow dish, mix together all-purpose flour, cornstarch, paprika, garlic powder, onion powder, salt, and black pepper. 3. Dredge marinated chicken pieces in the flour mixture, shaking off any excess. 4. Heat vegetable oil in a deep skillet or Dutch oven to 350°F (175°C). 5. Fry chicken pieces in batches until golden brown and cooked through, about 12-15 minutes depending on size. 6. Drain fried chicken on a wire rack or paper towels. 7. Serve hot with your favorite sides like mashed potatoes and coleslaw.",
          "cuisine": "American",
          "difficulty": "Medium",
          "image": "https://source.unsplash.com/random/900x700/?friedchicken",
          "likes": null,
          "averageRating": 0,
          "Rating": [],
          "comments": []
        },
        {
          "_id": {"$oid": "60abf0fd6f59b31e1c1189b9"},
          "name": "New York Style Pizza",
          "ingredients": ["Pizza Dough", "Tomato Sauce", "Mozzarella Cheese", "Olive Oil", "Fresh Basil Leaves", "Salt", "Black Pepper"],
          "instructions": "1. Preheat your oven to its highest setting with a pizza stone inside. 2. Stretch out the pizza dough into a circle. 3. Spread a thin layer of tomato sauce over the dough. 4. Tear the mozzarella cheese into pieces and distribute evenly over the sauce. 5. Drizzle with olive oil and season with salt and black pepper. 6. Transfer the pizza to the hot pizza stone and bake until the crust is golden and the cheese is bubbly and browned in spots. 7. Remove from the oven, let it cool slightly, then scatter fresh basil leaves over the pizza before serving.",
          "cuisine": "American",
          "difficulty": "Easy",
          "image": "https://source.unsplash.com/random/900x700/?pizza",
          "likes": null,
          "averageRating": 0,
          "Rating": [],
          "comments": []
        },
        {
          "_id": {"$oid": "60abf0fd6f59b31e1c1189ba"},
          "name": "BBQ Ribs",
          "ingredients": ["Pork Ribs", "BBQ Sauce", "Brown Sugar", "Paprika", "Garlic Powder", "Onion Powder", "Salt", "Black Pepper"],
          "instructions": "1. Preheat your grill to medium heat. 2. In a small bowl, mix together brown sugar, paprika, garlic powder, onion powder, salt, and black pepper to make a dry rub. 3. Rub the dry rub all over the pork ribs, covering them completely. 4. Place the ribs on the grill and cook for about 30-45 minutes, turning occasionally, until they are browned and cooked through. 5. Brush BBQ sauce over the ribs and continue to cook for another 10-15 minutes, basting with more sauce as needed. 6. Remove ribs from the grill and let them rest for a few minutes before serving.",
          "cuisine": "American",
          "difficulty": "Medium",
          "image": "https://source.unsplash.com/random/900x700/?bbqribs",
          "likes": null,
          "averageRating": 0,
          "Rating": [],
          "comments": []
        },
        {
          "_id": {"$oid": "60abf0fd6f59b31e1c1189bb"},
          "name": "Apple Pie",
          "ingredients": ["Pie Crust", "Apples", "Sugar", "Brown Sugar", "Cinnamon", "Nutmeg", "Lemon Juice", "Butter", "All-Purpose Flour"],
          "instructions": "1. Preheat your oven to 425°F (220°C). 2. Roll out one pie crust and place it into a pie dish. 3. Peel and slice the apples, then toss them with sugar, brown sugar, cinnamon, nutmeg, lemon juice, and all-purpose flour. 4. Pour the apple mixture into the pie crust. 5. Dot the top of the apples with small pieces of butter. 6. Roll out the second pie crust and place it over the apples. 7. Trim any excess dough and crimp the edges to seal the pie. 8. Cut slits in the top crust to allow steam to escape. 9. Bake for 45-50 minutes, or until the crust is golden brown and the filling is bubbly. 10. Let the pie cool before serving.",
          "cuisine": "American",
          "difficulty": "Medium",
          "image": "https://source.unsplash.com/random/900x700/?applepie",
          "likes": null,
          "averageRating": 0,
          "Rating": [],
          "comments": []
        },
        {
          "_id": {"$oid": "60abf0fd6f59b31e1c1189bc"},
          "name": "Caesar Salad",
          "ingredients": ["Romaine Lettuce", "Caesar Dressing", "Croutons", "Parmesan Cheese", "Lemon Juice", "Worcestershire Sauce", "Dijon Mustard", "Garlic", "Anchovy Fillets", "Olive Oil", "Salt", "Black Pepper"],
          "instructions": "1. Wash and dry the romaine lettuce, then tear it into bite-sized pieces. 2. In a large salad bowl, whisk together Caesar dressing, lemon juice, Worcestershire sauce, Dijon mustard, minced garlic, and mashed anchovy fillets. 3. Slowly drizzle in olive oil while whisking continuously until emulsified. 4. Add the romaine lettuce to the bowl and toss until evenly coated with the dressing. 5. Add croutons and grated Parmesan cheese, then season with salt and black pepper to taste. 6. Toss again until everything is well combined. 7. Serve immediately as a starter or side dish.",
          "cuisine": "American",
          "difficulty": "Easy",
          "image": "https://source.unsplash.com/random/900x700/?caesarsalad",
          "likes": null,
          "averageRating": 0,
          "Rating": [],
          "comments": []
        },
        {
          "_id": {"$oid": "60abf0fd6f59b31e1c1189bd"},
          "name": "Chocolate Chip Cookies",
          "ingredients": ["All-Purpose Flour", "Baking Soda", "Salt", "Unsalted Butter", "Brown Sugar", "Granulated Sugar", "Eggs", "Vanilla Extract", "Chocolate Chips"],
          "instructions": "1. Preheat your oven to 375°F (190°C). 2. In a medium bowl, whisk together all-purpose flour, baking soda, and salt. Set aside. 3. In a large bowl, cream together unsalted butter, brown sugar, and granulated sugar until light and fluffy. 4. Beat in eggs one at a time, then stir in vanilla extract. 5. Gradually blend the dry ingredients into the wet ingredients. 6. Stir in chocolate chips. 7. Drop dough by rounded spoonfuls onto ungreased baking sheets. 8. Bake for 8 to 10 minutes in the preheated oven, or until golden brown. 9. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely.",
          "cuisine": "American",
          "difficulty": "Easy",
          "image": "https://source.unsplash.com/random/900x700/?chocolatechipcookies",
          "likes": null,
          "averageRating": 0,
          "Rating": [],
          "comments": []
        },
        {
          "_id": {"$oid": "60abf0fd6f59b31e1c1189be"},
          "name": "Grilled Cheese Sandwich",
          "ingredients": ["Bread", "Cheddar Cheese", "Butter"],
          "instructions": "1. Heat a skillet or griddle over medium heat. 2. Butter one side of each slice of bread. 3. Place one slice of bread, buttered side down, on the skillet or griddle. 4. Top with slices of cheddar cheese and the other slice of bread, buttered side up. 5. Cook until the bottom is golden brown and the cheese is starting to melt. 6. Flip the sandwich and cook until the other side is golden brown and the cheese is completely melted. 7. Serve hot and enjoy!",
          "cuisine": "American",
          "difficulty": "Easy",
          "image": "https://source.unsplash.com/random/900x700/?grilledcheese",
          "likes": null,
          "averageRating": 0,
          "Rating": [],
          "comments": []
        },
        {
          "_id": {"$oid": "60abf0fd6f59b31e1c1189bf"},
          "name": "Buffalo Wings",
          "ingredients": ["Chicken Wings", "Hot Sauce", "Butter", "White Vinegar", "Salt", "Black Pepper", "Celery Sticks", "Blue Cheese Dressing"],
          "instructions": "1. Preheat your oven to 400°F (200°C). 2. Season chicken wings with salt and black pepper. 3. Arrange the wings in a single layer on a baking sheet lined with parchment paper. 4. Bake for 45-50 minutes, turning halfway through, until crispy and cooked through. 5. In a saucepan, combine hot sauce, melted butter, and white vinegar. Heat until butter is melted and the sauce is smooth. 6. Toss the baked wings in the sauce until evenly coated. 7. Serve hot with celery sticks and blue cheese dressing on the side.",
          "cuisine": "American",
          "difficulty": "Medium",
          "image": "https://source.unsplash.com/random/900x700/?buffalowings",
          "likes": null,
          "averageRating": 0,
          "Rating": [],
          "comments": []
        },
          {
            "_id": {"$oid": "60abf0fd6f59b31e1c1189c0"},
            "name": "Coq au Vin",
            "ingredients": ["Chicken", "Bacon", "Pearl Onions", "Carrots", "Mushrooms", "Red Wine", "Chicken Broth", "Garlic", "Thyme", "Bay Leaves", "Flour", "Butter", "Salt", "Black Pepper"],
            "instructions": "1. In a large pot, cook bacon until crispy. Remove and set aside. 2. Season chicken pieces with salt and black pepper, then brown them in the bacon fat. Remove and set aside. 3. In the same pot, sauté pearl onions, carrots, and mushrooms until slightly browned. 4. Add minced garlic and cook until fragrant. 5. Sprinkle flour over the vegetables and cook for a few minutes. 6. Deglaze the pot with red wine, scraping up any browned bits from the bottom. 7. Add chicken broth, thyme, and bay leaves. Return the chicken and bacon to the pot. 8. Simmer over low heat until the chicken is cooked through and the sauce has thickened. 9. Serve hot with crusty bread or over mashed potatoes.",
            "cuisine": "French",
            "difficulty": "Medium",
            "image": "https://source.unsplash.com/random/900x700/?coqauvin",
            "likes": null,
            "averageRating": 0,
            "Rating": [],
            "comments": []
          },
          {
            "_id": {"$oid": "60abf0fd6f59b31e1c1189c1"},
            "name": "Croque Monsieur",
            "ingredients": ["Bread Slices", "Ham", "Gruyere Cheese", "Butter", "All-Purpose Flour", "Milk", "Dijon Mustard", "Nutmeg", "Salt", "Black Pepper"],
            "instructions": "1. Preheat your oven broiler. 2. Make a béchamel sauce by melting butter in a saucepan, then whisking in flour to form a roux. Slowly pour in milk, whisking constantly, until the sauce thickens. Season with salt, pepper, and nutmeg. 3. Spread Dijon mustard on one side of each bread slice. Top half of the slices with ham and Gruyere cheese. 4. Place the remaining bread slices on top to form sandwiches. 5. Dip each sandwich in the béchamel sauce to coat both sides. 6. Place the sandwiches on a baking sheet and sprinkle with more Gruyere cheese. 7. Broil in the oven until the cheese is melted and bubbly. 8. Serve hot with a side salad.",
            "cuisine": "French",
            "difficulty": "Medium",
            "image": "https://source.unsplash.com/random/900x700/?croquemonsieur",
            "likes": null,
            "averageRating": 0,
            "Rating": [],
            "comments": []
          },
          {
            "_id": {"$oid": "60abf0fd6f59b31e1c1189c2"},
            "name": "French Onion Soup",
            "ingredients": ["Onions", "Beef Broth", "White Wine", "Baguette", "Gruyere Cheese", "Butter", "Olive Oil", "Salt", "Black Pepper", "Thyme"],
            "instructions": "1. Slice onions thinly. 2. Heat butter and olive oil in a large pot over medium-low heat. Add onions and cook slowly until caramelized, about 30-40 minutes. Stir occasionally. 3. Deglaze the pot with white wine and simmer until the wine has evaporated. 4. Add beef broth and thyme to the pot. Season with salt and black pepper. Simmer for another 20-30 minutes. 5. Preheat your oven broiler. 6. Ladle the soup into oven-safe bowls. Top each bowl with a slice of toasted baguette and grated Gruyere cheese. 7. Place the bowls under the broiler until the cheese is melted and bubbly. 8. Serve hot.",
            "cuisine": "French",
            "difficulty": "Medium",
            "image": "https://source.unsplash.com/random/900x700/?frenchonionsoup",
            "likes": null,
            "averageRating": 0,
            "Rating": [],
            "comments": []
          },
          {
            "_id": {"$oid": "60abf0fd6f59b31e1c1189c3"},
            "name": "Quiche Lorraine",
            "ingredients": ["Pie Crust", "Bacon", "Gruyere Cheese", "Eggs", "Heavy Cream", "Salt", "Black Pepper", "Nutmeg"],
            "instructions": "1. Preheat your oven to 375°F (190°C). 2. Line a pie dish with pie crust and trim any excess. 3. In a skillet, cook bacon until crispy. Drain on paper towels and chop into small pieces. 4. Sprinkle bacon and grated Gruyere cheese evenly over the bottom of the pie crust. 5. In a bowl, whisk together eggs, heavy cream, salt, pepper, and nutmeg. Pour the egg mixture over the bacon and cheese. 6. Bake in the preheated oven for 35-40 minutes, or until the quiche is set and the crust is golden brown. 7. Let it cool slightly before slicing and serving.",
            "cuisine": "French",
            "difficulty": "Medium",
            "image": "https://source.unsplash.com/random/900x700/?quichelorraine",
            "likes": null,
            "averageRating": 0,
            "Rating": [],
            "comments": []
          },
          {
            "_id": {"$oid": "60abf0fd6f59b31e1c1189c4"},
            "name": "Salade Niçoise",
            "ingredients": ["Mixed Salad Greens", "Tuna", "Boiled Eggs", "Tomatoes", "Cucumber", "Red Onion", "Olives", "Anchovies", "Green Beans", "Potatoes", "Dijon Mustard", "Red Wine Vinegar", "Olive Oil", "Salt", "Black Pepper"],
            "instructions": "1. Cook green beans until tender-crisp, then plunge into ice water to stop cooking. Drain and set aside. 2. Boil potatoes until tender, then let them cool before slicing. 3. Arrange mixed salad greens on a serving platter. 4. Top with tuna, boiled eggs (halved), tomatoes (quartered), cucumber (sliced), red onion (thinly sliced), olives, anchovies, green beans, and potatoes. 5. In a small bowl, whisk together Dijon mustard, red wine vinegar, olive oil, salt, and black pepper to make the dressing. 6. Drizzle the dressing over the salad just before serving.",
            "cuisine": "French",
            "difficulty": "Easy",
            "image": "https://source.unsplash.com/random/900x700/?saladenicoise",
            "likes": null,
            "averageRating": 0,
            "Rating": [],
            "comments": []
          },
          {
            "_id": {"$oid": "60abf0fd6f59b31e1c1189c5"},
            "name": "Boeuf Bourguignon",
            "ingredients": ["Beef Chuck", "Bacon", "Carrots", "Onions", "Garlic", "Button Mushrooms", "Red Wine", "Beef Broth", "Tomato Paste", "Flour", "Butter", "Thyme", "Bay Leaves", "Salt", "Black Pepper"],
            "instructions": "1. Cut beef chuck into cubes and season with salt and black pepper. 2. In a large pot, cook bacon until crispy. Remove and set aside. 3. Brown beef cubes in the bacon fat. Remove and set aside. 4. Sauté carrots, onions, and garlic in the same pot until softened. 5. Sprinkle flour over the vegetables and cook for a few minutes. 6. Deglaze the pot with red wine, scraping up any browned bits from the bottom. 7. Add beef broth, tomato paste, thyme, bay leaves, and the cooked beef and bacon back to the pot. 8. Simmer over low heat until the beef is tender, about 2-3 hours. 9. In a separate pan, sauté button mushrooms until browned and add them to the pot. 10. Serve hot with crusty bread or over mashed potatoes.",
            "cuisine": "French",
            "difficulty": "Medium",
            "image": "https://source.unsplash.com/random/900x700/?boeufbourguignon",
            "likes": null,
            "averageRating": 0,
            "Rating": [],
            "comments": []
          },
          {
            "_id": {"$oid": "60abf0fd6f59b31e1c1189c6"},
            "name": "Ratatouille",
            "ingredients": ["Eggplant", "Zucchini", "Yellow Squash", "Bell Peppers", "Tomatoes", "Onion", "Garlic", "Fresh Basil", "Fresh Thyme", "Olive Oil", "Salt", "Black Pepper"],
            "instructions": "1. Preheat your oven to 375°F (190°C). 2. Slice eggplant, zucchini, yellow squash, bell peppers, and tomatoes into thin rounds. 3. Thinly slice onion and mince garlic. 4. Drizzle olive oil in the bottom of a baking dish. Arrange the sliced vegetables in an overlapping pattern, alternating colors. 5. Season with salt, black pepper, minced garlic, fresh basil, and fresh thyme. Drizzle with more olive oil. 6. Cover the baking dish with foil and bake for 45-60 minutes, or until the vegetables are tender. 7. Remove the foil and bake for an additional 10-15 minutes to brown the top. 8. Serve hot as a side dish or over cooked grains like rice or quinoa.",
            "cuisine": "French",
            "difficulty": "Easy",
            "image": "https://source.unsplash.com/random/900x700/?ratatouille",
            "likes": null,
            "averageRating": 0,
            "Rating": [],
            "comments": []
          },
          {
            "_id": {"$oid": "60abf0fd6f59b31e1c1189c7"},
            "name": "Crepes",
            "ingredients": ["All-Purpose Flour", "Eggs", "Milk", "Water", "Butter", "Salt", "Sugar"],
            "instructions": "1. In a blender, combine all-purpose flour, eggs, milk, water, melted butter, salt, and sugar. Blend until smooth. 2. Let the batter rest for at least 30 minutes. 3. Heat a non-stick skillet over medium heat. 4. Pour a small ladleful of batter into the skillet and swirl it around to coat the bottom evenly. 5. Cook until the edges of the crepe start to lift and the bottom is golden brown. 6. Flip the crepe and cook for another 30 seconds to 1 minute on the other side. 7. Repeat with the remaining batter, stacking the cooked crepes on a plate. 8. Serve hot with your favorite sweet or savory fillings.",
            "cuisine": "French",
            "difficulty": "Easy",
            "image": "https://source.unsplash.com/random/900x700/?crepes",
            "likes": null,
            "averageRating": 0,
            "Rating": [],
            "comments": []
          },
          {
            "_id": {"$oid": "60abf0fd6f59b31e1c1189c8"},
            "name": "Beef Tartare",
            "ingredients": ["Beef Tenderloin", "Egg Yolk", "Dijon Mustard", "Capers", "Cornichons", "Shallots", "Parsley", "Tabasco Sauce", "Worcestershire Sauce", "Olive Oil", "Salt", "Black Pepper"],
            "instructions": "1. Finely chop beef tenderloin and place it in a bowl. 2. Finely chop capers, cornichons, shallots, and parsley. Add them to the bowl with the beef. 3. In a separate bowl, whisk together egg yolk, Dijon mustard, Tabasco sauce, Worcestershire sauce, olive oil, salt, and black pepper. 4. Pour the dressing over the beef mixture and toss until well combined. 5. Divide the beef tartare into individual servings and shape them into rounds using a ring mold. 6. Garnish with additional chopped parsley and serve immediately with toasted bread or crackers.",
            "cuisine": "French",
            "difficulty": "Medium",
            "image": "https://source.unsplash.com/random/900x700/?beeftartare",
            "likes": null,
            "averageRating": 0,
            "Rating": [],
            "comments": []
          },
          {
            "_id": {"$oid": "60abf0fd6f59b31e1c1189c9"},
            "name": "Chocolate Soufflé",
            "ingredients": ["Butter", "Granulated Sugar", "Bittersweet Chocolate", "Eggs", "Cornstarch", "Salt", "Cream of Tartar", "Powdered Sugar"],
            "instructions": "1. Preheat your oven to 375°F (190°C). 2. Butter the inside of individual soufflé dishes and coat with granulated sugar, tapping out any excess. 3. Melt bittersweet chocolate in a double boiler until smooth. Let it cool slightly. 4. Separate egg yolks from whites. Beat egg yolks with cornstarch and salt until pale and thick. 5. Stir melted chocolate into the egg yolk mixture until well combined. 6. In a separate bowl, beat egg whites with cream of tartar until stiff peaks form. 7. Gently fold the egg whites into the chocolate mixture until no streaks remain. 8. Divide the mixture evenly among the prepared soufflé dishes. 9. Bake for 12-15 minutes, or until puffed and set. 10. Dust with powdered sugar before serving.",
            "cuisine": "French",
            "difficulty": "Difficult",
            "image": "https://source.unsplash.com/random/900x700/?chocolatesouffle",
            "likes": null,
            "averageRating": 0,
            "Rating": [],
            "comments": []
          },

          
            {
              "_id": {"$oid": "60abf0fd6f59b31e1c1189ca"},
              "name": "Kung Pao Chicken",
              "ingredients": ["Chicken Breast", "Peanuts", "Bell Peppers", "Dried Red Chilies", "Green Onions", "Garlic", "Ginger", "Soy Sauce", "Rice Vinegar", "Sugar", "Cornstarch", "Sesame Oil", "Vegetable Oil", "Salt", "Black Pepper"],
              "instructions": "1. Cut chicken breast into bite-sized pieces and marinate with soy sauce, rice vinegar, sugar, cornstarch, sesame oil, salt, and black pepper. Let it sit for 30 minutes. 2. Heat vegetable oil in a wok or skillet over high heat. Stir-fry dried red chilies until fragrant, then remove and set aside. 3. Add marinated chicken pieces to the wok and stir-fry until cooked through and browned. 4. Add minced garlic and ginger to the wok and stir-fry until fragrant. 5. Return dried red chilies to the wok along with peanuts, sliced bell peppers, and chopped green onions. Stir-fry for another minute. 6. Serve hot over steamed rice.",
              "cuisine": "Chinese",
              "difficulty": "Medium",
              "image": "https://source.unsplash.com/random/900x700/?kungpaochicken",
              "likes": null,
              "averageRating": 0,
              "Rating": [],
              "comments": []
            },
            {
              "_id": {"$oid": "60abf0fd6f59b31e1c1189cb"},
              "name": "Mapo Tofu",
              "ingredients": ["Soft Tofu", "Ground Pork", "Soy Sauce", "Chili Bean Paste", "Fermented Black Beans", "Garlic", "Ginger", "Green Onions", "Sichuan Peppercorns", "Cornstarch", "Vegetable Oil", "Salt", "Black Pepper"],
              "instructions": "1. Cut soft tofu into cubes and set aside. 2. Heat vegetable oil in a wok or skillet over medium heat. Add minced garlic, ginger, and chopped green onions. Stir-fry until fragrant. 3. Add ground pork to the wok and cook until browned. 4. Stir in chili bean paste and fermented black beans. Cook for another minute. 5. Pour in soy sauce and a little water to create the sauce. Bring to a simmer. 6. Gently add tofu cubes to the wok and simmer until heated through. 7. Mix cornstarch with water to make a slurry and add it to the wok to thicken the sauce. 8. Season with salt and black pepper to taste. 9. Serve hot with steamed rice.",
              "cuisine": "Chinese",
              "difficulty": "Medium",
              "image": "https://source.unsplash.com/random/900x700/?mapotofu",
              "likes": null,
              "averageRating": 0,
              "Rating": [],
              "comments": []
            },
            {
              "_id": {"$oid": "60abf0fd6f59b31e1c1189cc"},
              "name": "Sweet and Sour Pork",
              "ingredients": ["Pork Tenderloin", "Bell Peppers", "Pineapple Chunks", "Onion", "Garlic", "Ginger", "Soy Sauce", "Ketchup", "Rice Vinegar", "Sugar", "Cornstarch", "Vegetable Oil", "Salt", "Black Pepper"],
              "instructions": "1. Cut pork tenderloin into bite-sized pieces and season with salt and black pepper. 2. Heat vegetable oil in a wok or skillet over high heat. Stir-fry pork pieces until browned and cooked through. Remove and set aside. 3. In the same wok, add minced garlic and ginger, followed by diced bell peppers and onion. Stir-fry until slightly softened. 4. Return cooked pork to the wok along with pineapple chunks. 5. In a small bowl, mix together soy sauce, ketchup, rice vinegar, sugar, and cornstarch. Pour the sauce into the wok and stir to coat the ingredients. 6. Cook until the sauce thickens and everything is heated through. 7. Serve hot over steamed rice.",
              "cuisine": "Chinese",
              "difficulty": "Medium",
              "image": "https://source.unsplash.com/random/900x700/?sweetandsourpork",
              "likes": null,
              "averageRating": 0,
              "Rating": [],
              "comments": []
            },
            {
              "_id": {"$oid": "60abf0fd6f59b31e1c1189cd"},
              "name": "Spring Rolls",
              "ingredients": ["Spring Roll Wrappers", "Shredded Cabbage", "Carrots", "Bean Sprouts", "Shiitake Mushrooms", "Garlic", "Ginger", "Soy Sauce", "Sesame Oil", "Vegetable Oil", "Salt", "Black Pepper"],
              "instructions": "1. Heat vegetable oil in a wok or skillet over medium heat. Add minced garlic and ginger, followed by shredded cabbage, julienned carrots, sliced shiitake mushrooms, and bean sprouts. Stir-fry until vegetables are tender. 2. Season with soy sauce, sesame oil, salt, and black pepper. Stir to combine. 3. Remove from heat and let the filling cool slightly. 4. Place a spoonful of filling in the center of a spring roll wrapper. Fold in the sides and roll tightly. Seal the edge with a little water. 5. Heat vegetable oil in a deep fryer or pot to 350°F (175°C). Fry spring rolls until golden brown and crispy. 6. Drain on paper towels and serve hot with dipping sauce.",
              "cuisine": "Chinese",
              "difficulty": "Medium",
              "image": "https://source.unsplash.com/random/900x700/?springrolls",
              "likes": null,
              "averageRating": 0,
              "Rating": [],
              "comments": []
            },
            {
              "_id": {"$oid": "60abf0fd6f59b31e1c1189ce"},
              "name": "Egg Fried Rice",
              "ingredients": ["Cooked Rice", "Eggs", "Carrots", "Frozen Peas", "Green Onions", "Garlic", "Soy Sauce", "Vegetable Oil", "Salt", "Black Pepper"],
              "instructions": "1. Heat vegetable oil in a wok or skillet over medium heat. Add minced garlic and chopped green onions. Stir-fry until fragrant. 2. Push the aromatics to the side of the wok and crack eggs into the empty space. Scramble until cooked through. 3. Add diced carrots and frozen peas to the wok. Stir-fry until vegetables are tender. 4. Add cooked rice to the wok and break up any clumps. Stir-fry until rice is heated through. 5. Season with soy sauce, salt, and black pepper. Stir to combine evenly. 6. Serve hot as a side dish or add cooked protein for a main course.",
              "cuisine": "Chinese",
              "difficulty": "Easy",
              "image": "https://source.unsplash.com/random/900x700/?eggfriedrice",
              "likes": null,
              "averageRating": 0,
              "Rating": [],
              "comments": []
            },
            {
              "_id": {"$oid": "60abf0fd6f59b31e1c1189cf"},
              "name": "Beef and Broccoli",
              "ingredients": ["Beef Sirloin", "Broccoli Florets", "Garlic", "Ginger", "Soy Sauce", "Oyster Sauce", "Brown Sugar", "Cornstarch", "Vegetable Oil", "Salt", "Black Pepper"],
              "instructions": "1. Slice beef sirloin thinly against the grain and marinate with soy sauce, oyster sauce, brown sugar, cornstarch, salt, and black pepper. Let it sit for 30 minutes. 2. Heat vegetable oil in a wok or skillet over high heat. Stir-fry minced garlic and ginger until fragrant. 3. Add marinated beef slices to the wok and stir-fry until browned. Remove and set aside. 4. In the same wok, stir-fry broccoli florets until tender-crisp. 5. Return cooked beef to the wok and stir to combine with the broccoli. 6. Serve hot over steamed rice.",
              "cuisine": "Chinese",
              "difficulty": "Medium",
              "image": "https://source.unsplash.com/random/900x700/?beefandbroccoli",
              "likes": null,
              "averageRating": 0,
              "Rating": [],
              "comments": []
            },
            {
              "_id": {"$oid": "60abf0fd6f59b31e1c1189d0"},
              "name": "Hot and Sour Soup",
              "ingredients": ["Chicken Broth", "Shiitake Mushrooms", "Tofu", "Bamboo Shoots", "Eggs", "Soy Sauce", "Rice Vinegar", "Sesame Oil", "Cornstarch", "White Pepper", "Green Onions"],
              "instructions": "1. Bring chicken broth to a simmer in a pot. 2. Add sliced shiitake mushrooms, cubed tofu, and sliced bamboo shoots to the pot. Simmer until vegetables are tender. 3. In a small bowl, whisk together soy sauce, rice vinegar, sesame oil, cornstarch, and white pepper to make a slurry. 4. Slowly pour the slurry into the simmering soup while stirring constantly. 5. Beat eggs in a bowl and slowly drizzle them into the soup, stirring gently to create ribbons. 6. Season with additional soy sauce or white pepper if needed. 7. Serve hot garnished with chopped green onions.",
              "cuisine": "Chinese",
              "difficulty": "Easy",
              "image": "https://source.unsplash.com/random/900x700/?hotandsoursoup",
              "likes": null,
              "averageRating": 0,
              "Rating": [],
              "comments": []
            },
            {
              "_id": {"$oid": "60abf0fd6f59b31e1c1189d1"},
              "name": "Dim Sum: Shumai",
              "ingredients": ["Ground Pork", "Shrimp", "Shiitake Mushrooms", "Bamboo Shoots", "Water Chestnuts", "Ginger", "Green Onions", "Soy Sauce", "Sesame Oil", "Rice Wine", "Cornstarch", "Wonton Wrappers"],
              "instructions": "1. Finely chop shrimp, shiitake mushrooms, bamboo shoots, water chestnuts, ginger, and green onions. 2. In a large bowl, mix together ground pork, chopped ingredients, soy sauce, sesame oil, rice wine, and cornstarch until well combined. 3. Place a spoonful of filling in the center of a wonton wrapper. Gather the edges and pleat the top, leaving the filling exposed. 4. Repeat with remaining filling and wrappers. 5. Place shumai on a steamer tray lined with parchment paper or cabbage leaves. Steam for 8-10 minutes, or until cooked through. 6. Serve hot with dipping sauce.",
              "cuisine": "Chinese",
              "difficulty": "Medium",
              "image": "https://source.unsplash.com/random/900x700/?shumai",
              "likes": null,
              "averageRating": 0,
              "Rating": [],
              "comments": []
            },
            {
              "_id": {"$oid": "60abf0fd6f59b31e1c1189d2"},
              "name": "Peking Duck",
              "ingredients": ["Duck", "Honey", "Soy Sauce", "Ginger", "Garlic", "Star Anise", "Cinnamon", "Green Onions", "Cucumber", "Pancakes"],
              "instructions": "1. Rinse duck under cold water and pat dry with paper towels. 2. In a small bowl, mix together honey, soy sauce, minced ginger, minced garlic, star anise, and cinnamon to make the marinade. 3. Rub the marinade all over the duck, including inside the cavity. Let it marinate in the refrigerator for at least 4 hours or overnight. 4. Preheat your oven to 350°F (175°C). 5. Place the duck on a roasting rack and roast for 2-3 hours, basting with the marinade every 30 minutes, until the skin is crispy and golden brown. 6. Let the duck rest for 15-20 minutes before carving. 7. Serve carved duck with sliced green onions, cucumber, and pancakes.",
              "cuisine": "Chinese",
              "difficulty": "Difficult",
              "image": "https://source.unsplash.com/random/900x700/?pekingduck",
              "likes": null,
              "averageRating": 0,
              "Rating": [],
              "comments": []
            },
            {
              "_id": {"$oid": "60abf0fd6f59b31e1c1189d3"},
              "name": "Chow Mein",
              "ingredients": ["Chow Mein Noodles", "Chicken Breast", "Shrimp", "Carrots", "Celery", "Bell Peppers", "Bean Sprouts", "Garlic", "Ginger", "Soy Sauce", "Oyster Sauce", "Vegetable Oil", "Salt", "Black Pepper"],
              "instructions": "1. Cook chow mein noodles according to package instructions. Drain and set aside. 2. Cut chicken breast into bite-sized pieces and season with soy sauce, salt, and black pepper. 3. Heat vegetable oil in a wok or skillet over high heat. Stir-fry minced garlic and ginger until fragrant. 4. Add seasoned chicken pieces to the wok and stir-fry until cooked through. Remove and set aside. 5. Stir-fry shrimp until pink and cooked through. Remove and set aside. 6. Add julienned carrots, sliced celery, diced bell peppers, and bean sprouts to the wok. Stir-fry until vegetables are tender-crisp. 7. Return cooked chicken and shrimp to the wok. Add cooked chow mein noodles and oyster sauce. Stir-fry until everything is heated through and well combined. 8. Serve hot.",
              "cuisine": "Chinese",
              "difficulty": "Medium",
              "image": "https://source.unsplash.com/random/900x700/?chowmein",
              "likes": null,
              "averageRating": 0,
              "Rating": [],
              "comments": []
            },
            
              {
                "_id": {"$oid": "60abf0fd6f59b31e1c1189d4"},
                "name": "Sushi Rolls (Maki)",
                "ingredients": ["Sushi Rice", "Nori Seaweed Sheets", "Assorted Fish (such as tuna, salmon, and yellowtail)", "Cucumber", "Avocado", "Carrots", "Soy Sauce", "Wasabi", "Pickled Ginger"],
                "instructions": "1. Prepare sushi rice according to package instructions and let it cool to room temperature. 2. Place a nori seaweed sheet on a bamboo sushi mat. 3. Spread a thin layer of sushi rice evenly over the nori, leaving a small border along the top edge. 4. Arrange thinly sliced fish, cucumber sticks, avocado slices, and julienned carrots on top of the rice. 5. Using the bamboo mat, roll the sushi tightly from bottom to top, applying gentle pressure to seal the roll. 6. Slice the roll into bite-sized pieces using a sharp knife dipped in water. 7. Serve with soy sauce, wasabi, and pickled ginger.",
                "cuisine": "Japanese",
                "difficulty": "Medium",
                "image": "https://source.unsplash.com/random/900x700/?sushi",
                "likes": null,
                "averageRating": 0,
                "Rating": [],
                "comments": []
              },
              {
                "_id": {"$oid": "60abf0fd6f59b31e1c1189d5"},
                "name": "Ramen",
                "ingredients": ["Ramen Noodles", "Chicken Broth", "Pork Belly", "Soft-Boiled Eggs", "Bamboo Shoots", "Noritamago (seasoned seaweed)", "Green Onions", "Bean Sprouts", "Soy Sauce", "Mirin", "Sesame Oil"],
                "instructions": "1. Bring chicken broth to a simmer in a pot. Season with soy sauce, mirin, and sesame oil to taste. 2. Cook ramen noodles according to package instructions. Drain and set aside. 3. Slice pork belly thinly and sear until browned and crispy on both sides. 4. Soft-boil eggs and peel carefully. 5. Divide cooked noodles among serving bowls. 6. Pour hot broth over the noodles. 7. Arrange sliced pork belly, soft-boiled eggs, bamboo shoots, noritamago, green onions, and bean sprouts on top of the noodles. 8. Serve hot.",
                "cuisine": "Japanese",
                "difficulty": "Medium",
                "image": "https://source.unsplash.com/random/900x700/?ramen",
                "likes": null,
                "averageRating": 0,
                "Rating": [],
                "comments": []
              },
              {
                "_id": {"$oid": "60abf0fd6f59b31e1c1189d6"},
                "name": "Tempura",
                "ingredients": ["Shrimp", "Assorted Vegetables (such as sweet potatoes, zucchini, and bell peppers)", "All-Purpose Flour", "Cornstarch", "Baking Powder", "Egg", "Ice Water", "Soy Sauce", "Rice Vinegar", "Mirin", "Grated Daikon Radish", "Grated Ginger"],
                "instructions": "1. Peel and devein shrimp, leaving tails intact. Cut vegetables into bite-sized pieces. 2. In a bowl, mix together all-purpose flour, cornstarch, baking powder, egg, and ice water until smooth. The batter should be thin and runny. 3. Heat vegetable oil in a deep fryer or pot to 350°F (175°C). 4. Dip shrimp and vegetables into the batter, shaking off any excess. 5. Fry in batches until golden brown and crispy. Drain on paper towels. 6. Serve hot with dipping sauce made from soy sauce, rice vinegar, and mirin, garnished with grated daikon radish and grated ginger.",
                "cuisine": "Japanese",
                "difficulty": "Medium",
                "image": "https://source.unsplash.com/random/900x700/?tempura",
                "likes": null,
                "averageRating": 0,
                "Rating": [],
                "comments": []
              },
              {
                "_id": {"$oid": "60abf0fd6f59b31e1c1189d7"},
                "name": "Tonkatsu",
                "ingredients": ["Pork Loin", "Panko Breadcrumbs", "Egg", "All-Purpose Flour", "Salt", "Black Pepper", "Cabbage", "Rice", "Tonkatsu Sauce"],
                "instructions": "1. Tenderize pork loin slices with a meat mallet until thin. Season with salt and black pepper. 2. Dredge pork slices in all-purpose flour, then dip in beaten egg, and finally coat with panko breadcrumbs. Press breadcrumbs firmly onto the pork. 3. Heat vegetable oil in a skillet over medium heat. Fry pork slices until golden brown and cooked through, about 3-4 minutes per side. 4. Drain on paper towels. 5. Serve hot with shredded cabbage, steamed rice, and tonkatsu sauce.",
                "cuisine": "Japanese",
                "difficulty": "Medium",
                "image": "https://source.unsplash.com/random/900x700/?tonkatsu",
                "likes": null,
                "averageRating": 0,
                "Rating": [],
                "comments": []
              },
              {
                "_id": {"$oid": "60abf0fd6f59b31e1c1189d8"},
                "name": "Gyoza (Japanese Dumplings)",
                "ingredients": ["Ground Pork", "Cabbage", "Garlic", "Ginger", "Green Onions", "Soy Sauce", "Sesame Oil", "Gyoza Wrappers", "Water", "Vegetable Oil", "Soy Sauce", "Rice Vinegar"],
                "instructions": "1. Finely chop cabbage, garlic, ginger, and green onions. 2. In a bowl, mix together ground pork, chopped vegetables, soy sauce, and sesame oil until well combined. 3. Place a spoonful of filling in the center of a gyoza wrapper. Moisten the edge of the wrapper with water. Fold the wrapper in half and pleat the edge to seal tightly. 4. Heat vegetable oil in a skillet over medium heat. Arrange gyoza in a single layer in the skillet. Cook until the bottoms are golden brown. 5. Carefully add water to the skillet and cover immediately. Steam for 6-8 minutes, or until the filling is cooked through and the wrappers are translucent. 6. Serve hot with dipping sauce made from soy sauce and rice vinegar.",
                "cuisine": "Japanese",
                "difficulty": "Medium",
                "image": "https://source.unsplash.com/random/900x700/?gyoza",
                "likes": null,
                "averageRating": 0,
                "Rating": [],
                "comments": []
              },
              {
                "_id": {"$oid": "60abf0fd6f59b31e1c1189d9"},
                "name": "Okonomiyaki",
                "ingredients": ["Cabbage", "Flour", "Eggs", "Bacon", "Green Onions", "Tenkasu (tempura scraps)", "Beni Shoga (pickled ginger)", "Okonomiyaki Sauce", "Japanese Mayonnaise", "Aonori (dried seaweed flakes)", "Katsuobushi (bonito flakes)"],
                "instructions": "1. Shred cabbage and chop green onions. 2. In a bowl, mix together shredded cabbage, flour, eggs, chopped green onions, and tenkasu until well combined. 3. Heat a non-stick skillet over medium heat. Pour the cabbage mixture into the skillet to form a pancake. 4. Arrange bacon slices on top of the pancake. Cook until the bottom is golden brown and crispy. 5. Flip the okonomiyaki and cook the other side until golden brown and cooked through. 6. Transfer okonomiyaki to a plate and drizzle with okonomiyaki sauce and Japanese mayonnaise. 7. Sprinkle with aonori and katsuobushi before serving.",
                "cuisine": "Japanese",
                "difficulty": "Medium",
                "image": "https://source.unsplash.com/random/900x700/?okonomiyaki",
                "likes": null,
                "averageRating": 0,
                "Rating": [],
                "comments": []
              },
              {
                "_id": {"$oid": "60abf0fd6f59b31e1c1189da"},
                "name": "Udon Noodle Soup",
                "ingredients": ["Udon Noodles", "Dashi Stock", "Mirin", "Soy Sauce", "Sugar", "Green Onions", "Fish Cake", "Narutomaki (fish cake with pink swirl)", "Kamaboko (fish cake)", "Aburaage (fried tofu pouch)", "Shiitake Mushrooms", "Spinach", "Soft-Boiled Egg"],
                "instructions": "1. Bring dashi stock to a simmer in a pot. Season with mirin, soy sauce, and sugar to taste. 2. Cook udon noodles according to package instructions. Drain and set aside. 3. Slice fish cake, narutomaki, kamaboko, aburaage, and shiitake mushrooms. Chop green onions. 4. Add sliced fish cake, narutomaki, kamaboko, aburaage, and shiitake mushrooms to the pot. Simmer until heated through. 5. Divide cooked udon noodles among serving bowls. Ladle hot soup over the noodles. 6. Garnish with chopped green onions and blanched spinach. Top with a soft-boiled egg.",
                "cuisine": "Japanese",
                "difficulty": "Medium",
                "image": "https://source.unsplash.com/random/900x700/?udonnoodlesoup",
                "likes": null,
                "averageRating": 0,
                "Rating": [],
                "comments": []
              },
              {
                "_id": {"$oid": "60abf0fd6f59b31e1c1189db"},
                "name": "Yakitori",
                "ingredients": ["Chicken Thighs", "Chicken Breast", "Green Onions", "Soy Sauce", "Mirin", "Sake", "Sugar", "Bamboo Skewers"],
                "instructions": "1. Cut chicken thighs and chicken breast into bite-sized pieces. 2. Thread the chicken pieces onto bamboo skewers, alternating with pieces of green onions. 3. In a bowl, mix together soy sauce, mirin, sake, and sugar to make the yakitori sauce. 4. Grill the skewers over medium-high heat, basting with the yakitori sauce, until the chicken is cooked through and caramelized. 5. Serve hot with extra sauce on the side.",
                "cuisine": "Japanese",
                "difficulty": "Medium",
                "image": "https://source.unsplash.com/random/900x700/?yakitori",
                "likes": null,
                "averageRating": 0,
                "Rating": [],
                "comments": []
              },
              {
                "_id": {"$oid": "60abf0fd6f59b31e1c1189dc"},
                "name": "Soba Noodle Salad",
                "ingredients": ["Soba Noodles", "Cucumber", "Carrots", "Red Bell Pepper", "Edamame", "Green Onions", "Sesame Seeds", "Soy Sauce", "Rice Vinegar", "Mirin", "Sesame Oil", "Ginger", "Garlic"],
                "instructions": "1. Cook soba noodles according to package instructions. Drain and rinse under cold water to stop cooking. 2. Julienne cucumber, carrots, and red bell pepper. 3. In a bowl, whisk together soy sauce, rice vinegar, mirin, sesame oil, minced ginger, and minced garlic to make the dressing. 4. Toss cooked soba noodles with julienned vegetables, edamame, sliced green onions, and sesame seeds. 5. Drizzle dressing over the salad and toss to combine. 6. Serve chilled.",
                "cuisine": "Japanese",
                "difficulty": "Easy",
                "image": "https://source.unsplash.com/random/900x700/?sobanoodlesalad",
                "likes": null,
                "averageRating": 0,
                "Rating": [],
                "comments": []
              },
              {
                "_id": {"$oid": "60abf0fd6f59b31e1c1189dd"},
                "name": "Tonkotsu Ramen",
                "ingredients": ["Pork Bones", "Pork Belly", "Garlic", "Ginger", "Onion", "Green Onions", "Soy Sauce", "Mirin", "Sake", "Ramen Noodles", "Eggs", "Bean Sprouts", "Black Garlic Oil"],
                "instructions": "1. Roast pork bones in the oven until browned and fragrant. 2. Place roasted pork bones in a large pot and cover with water. Add sliced pork belly, smashed garlic cloves, sliced ginger, sliced onion, and green onion tops. 3. Bring to a boil, then reduce heat and simmer for 12-24 hours, skimming off any impurities that rise to the surface. 4. Strain the broth through a fine-mesh sieve and discard solids. Return the broth to the pot. 5. Season the broth with soy sauce, mirin, and sake to taste. 6. Cook ramen noodles according to package instructions. 7. Soft-boil eggs and peel carefully. 8. Divide cooked noodles among serving bowls. Ladle hot broth over the noodles. 9. Arrange sliced pork belly, soft-boiled eggs, bean sprouts, and chopped green onions on top. 10. Drizzle with black garlic oil before serving.",
                "cuisine": "Japanese",
                "difficulty": "Difficult",
                "image": "https://source.unsplash.com/random/900x700/?tonkotsuramen",
                "likes": null,
                "averageRating": 0,
                "Rating": [],
                "comments": []
              },
              
                {
                  "_id": {"$oid": "60abf0fd6f59b31e1c1189de"},
                  "name": "Tacos al Pastor",
                  "ingredients": ["Pork Shoulder", "Pineapple", "Corn Tortillas", "Onion", "Cilantro", "Lime", "Ancho Chilies", "Guajillo Chilies", "Garlic", "Achiote Paste", "Apple Cider Vinegar", "Orange Juice", "Mexican Oregano", "Cumin", "Salt"],
                  "instructions": "1. Marinate pork shoulder with diced pineapple, sliced onion, minced garlic, ancho chilies, guajillo chilies, achiote paste, apple cider vinegar, orange juice, Mexican oregano, cumin, and salt. Let it marinate for at least 4 hours or overnight. 2. Preheat a grill or grill pan over medium-high heat. 3. Skewer marinated pork shoulder slices and pineapple chunks onto a vertical rotisserie or metal skewers. 4. Grill the skewered pork and pineapple until the edges are charred and the meat is cooked through. 5. Slice the grilled pork thinly. 6. Serve grilled pork and pineapple on warm corn tortillas, topped with diced onion, chopped cilantro, and a squeeze of lime juice.",
                  "cuisine": "Mexican",
                  "difficulty": "Medium",
                  "image": "https://source.unsplash.com/random/900x700/?tacosalpastor",
                  "likes": null,
                  "averageRating": 0,
                  "Rating": [],
                  "comments": []
                },
                {
                  "_id": {"$oid": "60abf0fd6f59b31e1c1189df"},
                  "name": "Guacamole",
                  "ingredients": ["Ripe Avocados", "Lime", "Red Onion", "Tomato", "Cilantro", "Jalapeno", "Garlic", "Salt", "Black Pepper"],
                  "instructions": "1. Cut ripe avocados in half and remove the pits. Scoop the avocado flesh into a mixing bowl. 2. Mash the avocado with a fork until smooth or leave it slightly chunky for texture. 3. Finely dice red onion, tomato, jalapeno, and garlic. Chop cilantro. 4. Add diced onion, tomato, jalapeno, garlic, and cilantro to the mashed avocado. 5. Squeeze fresh lime juice over the mixture and season with salt and black pepper to taste. 6. Stir until well combined. 7. Adjust seasoning if needed. 8. Serve guacamole with tortilla chips or as a topping for tacos, nachos, or burritos.",
                  "cuisine": "Mexican",
                  "difficulty": "Easy",
                  "image": "https://source.unsplash.com/random/900x700/?guacamole",
                  "likes": null,
                  "averageRating": 0,
                  "Rating": [],
                  "comments": []
                },
                {
                  "_id": {"$oid": "60abf0fd6f59b31e1c1189e0"},
                  "name": "Enchiladas",
                  "ingredients": ["Corn Tortillas", "Cooked Chicken", "Enchilada Sauce", "Cheese", "Onion", "Black Olives", "Green Chilies", "Cilantro", "Sour Cream", "Avocado"],
                  "instructions": "1. Preheat the oven to 350°F (175°C). 2. Warm corn tortillas in a skillet or microwave to make them pliable. 3. Fill each tortilla with cooked chicken, diced onion, sliced black olives, diced green chilies, and shredded cheese. Roll up the tortillas and place them seam-side down in a baking dish. 4. Pour enchilada sauce over the rolled tortillas, covering them completely. 5. Sprinkle additional cheese on top. 6. Bake in the preheated oven for 20-25 minutes, or until the cheese is melted and bubbly. 7. Garnish with chopped cilantro. 8. Serve hot with sour cream and sliced avocado.",
                  "cuisine": "Mexican",
                  "difficulty": "Medium",
                  "image": "https://source.unsplash.com/random/900x700/?enchiladas",
                  "likes": null,
                  "averageRating": 0,
                  "Rating": [],
                  "comments": []
                },
                {
                  "_id": {"$oid": "60abf0fd6f59b31e1c1189e1"},
                  "name": "Chiles Rellenos",
                  "ingredients": ["Poblano Peppers", "Monterey Jack Cheese", "Ground Beef", "Onion", "Garlic", "Tomatoes", "Eggs", "All-Purpose Flour", "Vegetable Oil", "Salt", "Black Pepper"],
                  "instructions": "1. Roast poblano peppers over an open flame or under the broiler until the skins are charred and blistered. Place the roasted peppers in a plastic bag and let them steam for 10 minutes. 2. Peel off the charred skins and make a vertical slit down the side of each pepper. Remove seeds and membranes, leaving the stems intact. 3. Stuff each pepper with shredded Monterey Jack cheese. 4. In a skillet, cook ground beef with diced onion, minced garlic, and chopped tomatoes until the meat is browned and the vegetables are softened. Season with salt and black pepper to taste. 5. Stuff the cooked beef mixture into the cheese-filled peppers. 6. Separate eggs and beat the egg whites until stiff peaks form. Fold in beaten egg yolks. 7. Dredge stuffed peppers in all-purpose flour, then dip in the beaten egg mixture. 8. Heat vegetable oil in a skillet over medium heat. Fry the battered peppers until golden brown on all sides. 9. Drain on paper towels. 10. Serve hot with salsa and rice.",
                  "cuisine": "Mexican",
                  "difficulty": "Medium",
                  "image": "https://source.unsplash.com/random/900x700/?chilesrellenos",
                  "likes": null,
                  "averageRating": 0,
                  "Rating": [],
                  "comments": []
                },
                {
                  "_id": {"$oid": "60abf0fd6f59b31e1c1189e2"},
                  "name": "Tamales",
                  "ingredients": ["Corn Husks", "Cornmeal", "Lard", "Chicken Broth", "Cooked Shredded Chicken", "Onion", "Garlic", "Cumin", "Chili Powder", "Salt", "Black Pepper"],
                  "instructions": "1. Soak corn husks in warm water for 30 minutes to soften. 2. In a mixing bowl, combine cornmeal, melted lard, chicken broth, minced onion, minced garlic, cumin, chili powder, salt, and black pepper to make the tamale dough. 3. Spread a thin layer of tamale dough on each softened corn husk. 4. Place a spoonful of cooked shredded chicken in the center of the dough. 5. Fold the sides of the corn husk over the filling, then fold up the bottom. 6. Tie each tamale with kitchen twine to secure. 7. Arrange tamales in a steamer basket and steam for 1-1.5 hours, or until the dough is firm and cooked through. 8. Let tamales cool slightly before serving. 9. Serve hot with salsa and refried beans.",
                  "cuisine": "Mexican",
                  "difficulty": "Difficult",
                  "image": "https://source.unsplash.com/random/900x700/?tamales",
                  "likes": null,
                  "averageRating": 0,
                  "Rating": [],
                  "comments": []
                },
                {
                  "_id": {"$oid": "60abf0fd6f59b31e1c1189e3"},
                  "name": "Quesadillas",
                  "ingredients": ["Flour Tortillas", "Shredded Cheese (such as Cheddar or Monterey Jack)", "Cooked Chicken", "Black Beans", "Corn Kernels", "Red Onion", "Cilantro", "Sour Cream", "Salsa"],
                  "instructions": "1. Heat a skillet or griddle over medium heat. 2. Place a flour tortilla on the skillet. 3. Sprinkle shredded cheese evenly over half of the tortilla. 4. Add cooked chicken, black beans, corn kernels, diced red onion, and chopped cilantro on top of the cheese. 5. Fold the tortilla in half to cover the filling. 6. Cook until the bottom is golden brown and crispy, then flip and cook the other side until golden brown and the cheese is melted. 7. Repeat with remaining tortillas and filling ingredients. 8. Slice quesadillas into wedges. 9. Serve hot with sour cream and salsa.",
                  "cuisine": "Mexican",
                  "difficulty": "Easy",
                  "image": "https://source.unsplash.com/random/900x700/?quesadillas",
                  "likes": null,
                  "averageRating": 0,
                  "Rating": [],
                  "comments": []
                },
                {
                  "_id": {"$oid": "60abf0fd6f59b31e1c1189e4"},
                  "name": "Pozole",
                  "ingredients": ["Hominy", "Pork Shoulder", "Chicken Broth", "Onion", "Garlic", "Dried Chilies", "Cumin", "Mexican Oregano", "Radishes", "Cabbage", "Lime", "Tortilla Chips"],
                  "instructions": "1. In a large pot, combine hominy, diced pork shoulder, chicken broth, sliced onion, minced garlic, dried chilies, cumin, and Mexican oregano. 2. Bring to a boil, then reduce heat and simmer until the pork is tender and the flavors are melded, about 2-3 hours. 3. Remove the dried chilies and discard. 4. Ladle pozole into serving bowls. 5. Garnish with sliced radishes, shredded cabbage, a squeeze of lime juice, and crushed tortilla chips. 6. Serve hot.",
                  "cuisine": "Mexican",
                  "difficulty": "Medium",
                  "image": "https://source.unsplash.com/random/900x700/?pozole",
                  "likes": null,
                  "averageRating": 0,
                  "Rating": [],
                  "comments": []
                },
                {
                  "_id": {"$oid": "60abf0fd6f59b31e1c1189e5"},
                  "name": "Churros",
                  "ingredients": ["Water", "Butter", "All-Purpose Flour", "Eggs", "Sugar", "Cinnamon", "Vegetable Oil"],
                  "instructions": "1. In a saucepan, combine water and butter and bring to a boil. 2. Reduce heat to low and add all-purpose flour. Stir vigorously until the mixture forms a ball and pulls away from the sides of the pan. Remove from heat and let cool slightly. 3. Beat eggs into the dough, one at a time, until fully incorporated. 4. Transfer dough to a piping bag fitted with a star tip. 5. Heat vegetable oil in a deep fryer or pot to 375°F (190°C). 6. Pipe strips of dough into the hot oil, using scissors to cut them to the desired length. Fry until golden brown and crispy. 7. Drain churros on paper towels. 8. Mix sugar and cinnamon in a shallow dish. Roll warm churros in the cinnamon sugar mixture to coat. 9. Serve hot with chocolate sauce or dulce de leche for dipping.",
                  "cuisine": "Mexican",
                  "difficulty": "Medium",
                  "image": "https://source.unsplash.com/random/900x700/?churros",
                  "likes": null,
                  "averageRating": 0,
                  "Rating": [],
                  "comments": []
                },
                {
                  "_id": {"$oid": "60abf0fd6f59b31e1c1189e6"},
                  "name": "Mole",
                  "ingredients": ["Dried Chilies", "Tomatoes", "Onion", "Garlic", "Almonds", "Sesame Seeds", "Raisins", "Cinnamon", "Cloves", "Chocolate", "Chicken Broth", "Cooked Chicken"],
                  "instructions": "1. Toast dried chilies in a dry skillet until fragrant. Remove stems and seeds. 2. In the same skillet, toast sesame seeds and almonds until golden brown. 3. Blend toasted chilies, sesame seeds, almonds, chopped tomatoes, diced onion, minced garlic, raisins, cinnamon, cloves, and chocolate until smooth. Add chicken broth as needed to achieve a thick sauce consistency. 4. Pour sauce into a saucepan and simmer over low heat for 20-30 minutes, stirring occasionally. 5. Season with salt to taste. 6. Serve mole sauce over cooked chicken.",
                  "cuisine": "Mexican",
                  "difficulty": "Medium",
                  "image": "https://source.unsplash.com/random/900x700/?mole",
                  "likes": null,
                  "averageRating": 0,
                  "Rating": [],
                  "comments": []
                },
                {
                  "_id": {"$oid": "60abf0fd6f59b31e1c1189e7"},
                  "name": "Tres Leches Cake",
                  "ingredients": ["All-Purpose Flour", "Baking Powder", "Salt", "Unsalted Butter", "Granulated Sugar", "Eggs", "Vanilla Extract", "Whole Milk", "Evaporated Milk", "Sweetened Condensed Milk", "Heavy Cream", "Sugar", "Strawberries"],
                  "instructions": "1. Preheat the oven to 350°F (175°C). Grease and flour a 9x13-inch baking dish. 2. In a bowl, whisk together all-purpose flour, baking powder, and salt. 3. In a separate bowl, cream together unsalted butter and granulated sugar until light and fluffy. Beat in eggs one at a time, then stir in vanilla extract. 4. Gradually add the flour mixture to the butter mixture, alternating with whole milk, until just combined. 5. Pour batter into the prepared baking dish and smooth the top with a spatula. 6. Bake in the preheated oven for 25-30 minutes, or until a toothpick inserted into the center comes out clean. 7. In a bowl, combine evaporated milk, sweetened condensed milk, and heavy cream. Poke holes all over the warm cake with a fork or toothpick, then pour the milk mixture over the cake. 8. Let the cake cool to room temperature, then refrigerate for at least 4 hours or overnight. 9. Before serving, whip heavy cream with sugar until stiff peaks form. Spread whipped cream over the chilled cake. 10. Garnish with sliced strawberries before serving.",
                  "cuisine": "Mexican",
                  "difficulty": "Medium",
                  "image": "https://source.unsplash.com/random/900x700/?treslechescake",
                  "likes": null,
                  "averageRating": 0,
                  "Rating": [],
                  "comments": []
                },
                
                  {
                    "_id": {"$oid": "60abf0fd6f59b31e1c1189e8"},
                    "name": "Chicken Tortilla Soup",
                    "ingredients": ["Chicken Breasts", "Onion", "Garlic", "Jalapeno", "Bell Pepper", "Tomatoes", "Chicken Broth", "Cumin", "Chili Powder", "Cayenne Pepper", "Black Beans", "Corn", "Lime", "Tortilla Strips", "Avocado", "Cilantro", "Sour Cream", "Shredded Cheese"],
                    "instructions": "1. In a large pot, sauté diced onion, minced garlic, diced jalapeno, and diced bell pepper until softened. 2. Add diced tomatoes (with juices), chicken broth, cumin, chili powder, and cayenne pepper to the pot. Bring to a simmer. 3. Add chicken breasts to the pot and simmer until cooked through, about 20-25 minutes. 4. Remove chicken breasts from the pot and shred with two forks. Return shredded chicken to the pot. 5. Stir in black beans and corn. Simmer for an additional 10 minutes. 6. Squeeze fresh lime juice into the soup and season with salt and black pepper to taste. 7. Serve hot, garnished with tortilla strips, sliced avocado, chopped cilantro, dollops of sour cream, and shredded cheese.",
                    "cuisine": "Southwestern",
                    "difficulty": "Easy",
                    "image": "https://source.unsplash.com/random/900x700/?chickentortillasoup",
                    "likes": null,
                    "averageRating": 0,
                    "Rating": [],
                    "comments": []
                  },
                  {
                    "_id": {"$oid": "60abf0fd6f59b31e1c1189e9"},
                    "name": "Chili con Carne",
                    "ingredients": ["Ground Beef", "Onion", "Garlic", "Bell Pepper", "Jalapeno", "Tomatoes", "Tomato Paste", "Beef Broth", "Chili Powder", "Cumin", "Paprika", "Cayenne Pepper", "Black Beans", "Kidney Beans", "Corn", "Salt", "Black Pepper", "Sour Cream", "Shredded Cheese", "Green Onions"],
                    "instructions": "1. In a large pot, cook ground beef over medium heat until browned. Drain excess fat. 2. Add diced onion, minced garlic, diced bell pepper, and diced jalapeno to the pot. Cook until vegetables are softened. 3. Stir in diced tomatoes, tomato paste, beef broth, chili powder, cumin, paprika, and cayenne pepper. Bring to a simmer. 4. Add drained and rinsed black beans, kidney beans, and corn to the pot. Simmer for 20-30 minutes, stirring occasionally. 5. Season with salt and black pepper to taste. 6. Serve hot, topped with dollops of sour cream, shredded cheese, and chopped green onions.",
                    "cuisine": "Southwestern",
                    "difficulty": "Medium",
                    "image": "https://source.unsplash.com/random/900x700/?chiliconcarne",
                    "likes": null,
                    "averageRating": 0,
                    "Rating": [],
                    "comments": []
                  },
                  {
                    "_id": {"$oid": "60abf0fd6f59b31e1c1189ea"},
                    "name": "Taco Salad",
                    "ingredients": ["Ground Beef", "Taco Seasoning", "Lettuce", "Tomatoes", "Black Beans", "Corn", "Avocado", "Red Onion", "Tortilla Chips", "Shredded Cheese", "Sour Cream", "Salsa"],
                    "instructions": "1. In a skillet, cook ground beef over medium heat until browned. Drain excess fat. 2. Stir in taco seasoning and cook according to package instructions. 3. In a large bowl, toss shredded lettuce, diced tomatoes, drained and rinsed black beans, drained corn kernels, diced avocado, and thinly sliced red onion. 4. Add cooked ground beef to the salad and toss to combine. 5. Top the salad with crushed tortilla chips, shredded cheese, dollops of sour cream, and salsa. 6. Serve immediately.",
                    "cuisine": "Southwestern",
                    "difficulty": "Easy",
                    "image": "https://source.unsplash.com/random/900x700/?tacosalad",
                    "likes": null,
                    "averageRating": 0,
                    "Rating": [],
                    "comments": []
                  },
                  {
                    "_id": {"$oid": "60abf0fd6f59b31e1c1189eb"},
                    "name": "Queso Dip",
                    "ingredients": ["Velveeta Cheese", "Canned Tomatoes with Green Chilies", "Ground Beef", "Onion", "Jalapeno", "Garlic", "Cumin", "Chili Powder", "Cayenne Pepper"],
                    "instructions": "1. In a slow cooker, combine cubed Velveeta cheese and canned tomatoes with green chilies. Cook on low heat until cheese is melted and mixture is smooth, stirring occasionally. 2. In a skillet, cook ground beef over medium heat until browned. Drain excess fat. 3. Add diced onion, diced jalapeno, and minced garlic to the skillet. Cook until vegetables are softened. 4. Stir cooked ground beef mixture into the queso dip. 5. Season with cumin, chili powder, and cayenne pepper to taste. 6. Keep warm in the slow cooker while serving, stirring occasionally. 7. Serve with tortilla chips for dipping.",
                    "cuisine": "Southwestern",
                    "difficulty": "Easy",
                    "image": "https://source.unsplash.com/random/900x700/?quesodip",
                    "likes": null,
                    "averageRating": 0,
                    "Rating": [],
                    "comments": []
                  },
                  {
                    "_id": {"$oid": "60abf0fd6f59b31e1c1189ec"},
                    "name": "Southwestern Stuffed Bell Peppers",
                    "ingredients": ["Bell Peppers", "Ground Beef", "Onion", "Garlic", "Corn", "Black Beans", "Rice", "Tomatoes", "Cheddar Cheese", "Cumin", "Chili Powder", "Salt", "Black Pepper"],
                    "instructions": "1. Preheat the oven to 375°F (190°C). 2. Cut the tops off the bell peppers and remove the seeds and membranes. 3. In a skillet, cook ground beef over medium heat until browned. Drain excess fat. 4. Add diced onion and minced garlic to the skillet. Cook until vegetables are softened. 5. Stir in drained and rinsed corn, black beans, cooked rice, diced tomatoes, shredded cheddar cheese, cumin, chili powder, salt, and black pepper. 6. Spoon the beef and rice mixture into the bell peppers, pressing down gently to pack the filling. 7. Place stuffed bell peppers in a baking dish and cover with aluminum foil. 8. Bake in the preheated oven for 25-30 minutes, or until the peppers are tender. 9. Remove foil and sprinkle additional cheese on top of each pepper. Return to the oven and bake for an additional 5 minutes, or until cheese is melted and bubbly. 10. Serve hot.",
                    "cuisine": "Southwestern",
                    "difficulty": "Medium",
                    "image": "https://source.unsplash.com/random/900x700/?stuffedbellpeppers",
                    "likes": null,
                    "averageRating": 0,
                    "Rating": [],
                    "comments": []
                  },
                  {
                    "_id": {"$oid": "60abf0fd6f59b31e1c1189ed"},
                    "name": "Southwestern Egg Rolls",
                    "ingredients": ["Egg Roll Wrappers", "Cooked Chicken", "Black Beans", "Corn", "Red Bell Pepper", "Green Onions", "Cilantro", "Monterey Jack Cheese", "Chili Powder", "Cumin", "Salt", "Black Pepper", "Vegetable Oil", "Sour Cream", "Salsa"],
                    "instructions": "1. In a large bowl, combine cooked and shredded chicken, drained and rinsed black beans, drained corn kernels, diced red bell pepper, sliced green onions, chopped cilantro, shredded Monterey Jack cheese, chili powder, cumin, salt, and black pepper. Mix well. 2. Place a spoonful of the chicken mixture onto the center of an egg roll wrapper. Fold in the sides and roll up tightly, sealing the edges with water. Repeat with remaining wrappers and filling. 3. Heat vegetable oil in a deep fryer or pot to 350°F (175°C). Fry egg rolls in batches until golden brown and crispy, about 3-4 minutes per batch. Drain on paper towels. 4. Serve hot with sour cream and salsa for dipping.",
                    "cuisine": "Southwestern",
                    "difficulty": "Medium",
                    "image": "https://source.unsplash.com/random/900x700/?eggrolls",
                    "likes": null,
                    "averageRating": 0,
                    "Rating": [],
                    "comments": []
                  },
                  {
                    "_id": {"$oid": "60abf0fd6f59b31e1c1189ee"},
                    "name": "Southwestern Quinoa Salad",
                    "ingredients": ["Quinoa", "Black Beans", "Corn", "Red Bell Pepper", "Green Bell Pepper", "Red Onion", "Cilantro", "Lime", "Olive Oil", "Cumin", "Chili Powder", "Salt", "Black Pepper", "Avocado"],
                    "instructions": "1. Rinse quinoa under cold water. In a saucepan, combine quinoa and water. Bring to a boil, then reduce heat to low and simmer, covered, for 15-20 minutes, or until quinoa is cooked and water is absorbed. Fluff with a fork and let cool. 2. In a large bowl, combine cooked quinoa, drained and rinsed black beans, drained corn kernels, diced red bell pepper, diced green bell pepper, diced red onion, chopped cilantro, lime juice, olive oil, cumin, chili powder, salt, and black pepper. Toss to combine. 3. Garnish with diced avocado before serving. Serve chilled or at room temperature.",
                    "cuisine": "Southwestern",
                    "difficulty": "Easy",
                    "image": "https://source.unsplash.com/random/900x700/?quinoasalad",
                    "likes": null,
                    "averageRating": 0,
                    "Rating": [],
                    "comments": []
                  },
                  {
                    "_id": {"$oid": "60abf0fd6f59b31e1c1189ef"},
                    "name": "Southwestern Breakfast Burritos",
                    "ingredients": ["Eggs", "Milk", "Tortillas", "Cooked Bacon", "Black Beans", "Salsa", "Shredded Cheese", "Avocado", "Cilantro", "Sour Cream"],
                    "instructions": "1. In a bowl, whisk together eggs and milk. Season with salt and black pepper. 2. Heat a skillet over medium heat and scramble the eggs until cooked through. 3. Warm tortillas in the skillet or microwave. 4. Assemble burritos by layering scrambled eggs, cooked bacon, drained and rinsed black beans, salsa, shredded cheese, sliced avocado, chopped cilantro, and a dollop of sour cream onto each tortilla. 5. Fold in the sides of the tortillas and roll up tightly to form burritos. 6. Serve immediately.",
                    "cuisine": "Southwestern",
                    "difficulty": "Easy",
                    "image": "https://source.unsplash.com/random/900x700/?breakfastburritos",
                    "likes": null,
                    "averageRating": 0,
                    "Rating": [],
                    "comments": []
                  },
                  {
                    "_id": {"$oid": "60abf0fd6f59b31e1c1189f0"},
                    "name": "Southwestern Stuffed Sweet Potatoes",
                    "ingredients": ["Sweet Potatoes", "Black Beans", "Corn", "Red Bell Pepper", "Red Onion", "Avocado", "Cilantro", "Lime", "Cumin", "Chili Powder", "Salt", "Black Pepper", "Sour Cream"],
                    "instructions": "1. Preheat the oven to 400°F (200°C). 2. Pierce sweet potatoes with a fork and place them on a baking sheet. Bake for 45-60 minutes, or until tender. 3. In a bowl, combine drained and rinsed black beans, drained corn kernels, diced red bell pepper, diced red onion, diced avocado, chopped cilantro, lime juice, cumin, chili powder, salt, and black pepper. Mix well. 4. Once sweet potatoes are cooked, slice them open and fluff the insides with a fork. 5. Spoon the black bean mixture onto the sweet potatoes. 6. Serve hot, topped with dollops of sour cream.",
                    "cuisine": "Southwestern",
                    "difficulty": "Easy",
                    "image": "https://source.unsplash.com/random/900x700/?stuffedsweetpotatoes",
                    "likes": null,
                    "averageRating": 0,
                    "Rating": [],
                    "comments": []
                  },
                  {
                    "_id": {"$oid": "60abf0fd6f59b31e1c1189f1"},
                    "name": "Southwestern Chicken Skillet",
                    "ingredients": ["Chicken Breasts", "Corn", "Black Beans", "Red Bell Pepper", "Yellow Bell Pepper", "Onion", "Jalapeno", "Garlic", "Cumin", "Chili Powder", "Salt", "Black Pepper", "Olive Oil", "Lime", "Cilantro", "Shredded Cheese", "Sour Cream", "Avocado"],
                    "instructions": "1. Season chicken breasts with cumin, chili powder, salt, and black pepper. 2. Heat olive oil in a skillet over medium-high heat. Add chicken breasts and cook until browned on both sides and cooked through, about 6-8 minutes per side. Remove from skillet and set aside. 3. In the same skillet, add diced onion, minced garlic, diced jalapeno, diced red bell pepper, and diced yellow bell pepper. Cook until vegetables are softened. 4. Stir in drained and rinsed black beans and drained corn kernels. Cook for an additional 2-3 minutes. 5. Return cooked chicken breasts to the skillet. Squeeze fresh lime juice over the skillet and sprinkle with chopped cilantro. 6. Top with shredded cheese and cover the skillet until cheese is melted. 7. Serve hot, garnished with sour cream and sliced avocado.",
                    "cuisine": "Southwestern",
                    "difficulty": "Easy",
                    "image": "https://source.unsplash.com/random/900x700/?chickenskillet",
                    "likes": null,
                    "averageRating": 0,
                    "Rating": [],
                    "comments": []
                  }
                
                
              
              
            
            
          
        
        
      
      
  
  ]
  
}